
let QUI = {
  level: null,
  qno: 0,
  length: 10, // 每個向度要出幾題
  random: [], // 隨機生成的題號
  score: [120, 162, 226, 292, 360, 420, 500, 600, 600], // 對應秒數答對時獲得的分數
  bonus: [1, 1.25, 1.5, 1.75, 2, 2.5, 3, 3.5, 3.5, 4], // 連續答對時倍率
  maxScore: 24 * 600
}


// 每個attribute對應到一個關卡(共10個)
const data = {
   '滋事份子': [
      {
         question: '彩虹的第八個顏色是什麼',
         choices: [
          '黑色',
          '粉紅色',
          '深綠色',
          '白色'
         ],
         ans: 1
      },
      {
         question: '動畫「我們這一家」中片尾曲中，明天會是什麼天氣',
         choices: [
          '晴天',
          '陰天',
          '壞天氣',
          '好天氣'
         ],
         ans: 4
      },
      {
         question: '反骨男孩「痘痘那邊」MV中，總共要花多少錢，偉哥才會帶你去痘痘那邊',
         choices: [
          '3000',
          '6000',
          '9000',
          '12000'
         ],
         ans: 4
      },
      {
         question: '高雄市，人口最多行政區，請韓市長回答。',
         choices: [
          '請經濟部能源局局長回答',
          '高雄發大財',
          '三民二',
          '以上皆是'
         ],
         ans: 4
      },
      {
         question: '跟你女朋友分手，因為？',
         choices: [
          '她很醜',
          '我很溫柔',
          '她技巧不好',
          '我很無聊'
         ],
         ans: 4
      },
      {
         question: '教室裡有3個女生，每個女生都有3個背包，每個背包有3隻貓，請問教室裡有多少隻腳？',
         choices: [
          '96',
          '120',
          '108',
          '114'
         ],
         ans: 4
      },
      {
         question: '你媽超胖',
         choices: [
          '胖到經過電視會漏看一季冰與火之歌',
          '因為看到你媽才把冥王星除名',
          '穿雨衣走在路上被當成計程車攔下來',
          '我媽還好'
         ],
         ans: 2
      },
      {
         question: '期中考有很多同學中途跑去上廁所，但廁所裡都沒聽到沖水的聲音，請問最有可能是哪個原因',
         choices: [
          '那間廁所沖水沒聲音',
          '褲子穿反到廁所換',
          '教室太熱拿廁所紙巾擦汗',
          '偷用手機查解答'
         ],
         ans: 4
      },
      {
         question: '請問 「欸～你是誰？」是誰的口頭禪',
         choices: [
          '趟延思',
          '趙廷思',
          '趙廷恩',
          '趙延恩'
         ],
         ans: 3
      },
      {
         question: '請問「登登登 登登 登登登登~登登登登~登登」是下面哪首歌的旋律?',
         choices: [
          'loser',
          'teenage riot',
          'flamigo',
          'lemon'
         ],
         ans: 4
      },
      {
         question: '請問09資工系學會會長在他應屆的學測國文作文長文部分拿了幾分',
         choices: [
          '8',
          '12',
          '16',
          '23'
         ],
         ans: 1
      },
      {
         question: '請問吃菜棒還是吃肉棒？',
         choices: [
          '菜棒',
          '肉棒',
          '營養均衡就好棒',
          '蟹肉棒'
         ],
         ans: 3
      },
      {
         question: '請問海獅會幹嘛？',
         choices: [
          '害怕',
          '跳舞',
          '頂球',
          '游泳'
         ],
         ans: 1
      },
      {
         question: '請問黃政鈺的本名是什麼',
         choices: [
          '瓜呱',
          '呱呱',
          '爪爪',
          '瓜瓜'
         ],
         ans: 4
      },
      {
         question: '請問舊式電話按鍵5所發出的聲音是由哪兩個音頻所組成',
         choices: [
          '697Hz / 770Hz',
          '697Hz / 1477Hz',
          '770Hz / 1477Hz',
          '770Hz / 1336Hz'
         ],
         ans: 4
      },
      {
         question: '請問胖胖傑今天很餓，想點一份拿坡里母親節活動的媽咪A餐，請問他要付多少錢',
         choices: [
          '1299元',
          '1439元',
          '1479元',
          '1569元'
         ],
         ans: 2
      },
      {
         question: '請問圓周率3.14...小數點後第7位是什麼數字？',
         choices: [
          '2',
          '5',
          '6',
          '9'
         ],
         ans: 3
      },
      {
         question: '請問直播主「連千毅」請網友吃了幾個漢堡',
         choices: [
          '8',
          '9',
          '10',
          '11'
         ],
         ans: 3
      },
      {
         question: '請問資工周活動「麵麵巨道」宣傳影片中出現了幾個「然後」',
         choices: [
          '11',
          '13',
          '15',
          '17'
         ],
         ans: 4
      },
      {
         question: '請問google小恐龍，背上有幾支刺',
         choices: [
          '0',
          '1',
          '2',
          '3'
         ],
         ans: 1
      },
      {
         question: '請問IKEA的正確發音是什麼?',
         choices: [
          'IKEA',
          'IKEA',
          'IKEA',
          'IKEA'
         ],
         ans: 3
      },
      {
         question: '請問Mac系列筆電從哪一年開始蘋果LOGO燈不再發亮',
         choices: [
          '2014',
          '2015',
          '2016',
          '2017'
         ],
         ans: 3
      },
      {
         question: '什麼東西遠看像水桶，近看破個洞？',
         choices: [
          '籃筐',
          '水壺',
          '破水桶',
          '你的腦袋'
         ],
         ans: 4
      },
      {
         question: '什麼東西讓我走得好緩慢',
         choices: [
          '你的行李',
          '你的背包',
          '你的體重',
          '你媽'
         ],
         ans: 2
      },
      {
         question: '為什麼跑步的時候不能拿碗？',
         choices: [
          '因為會想吃飯',
          '因為碗很重',
          '因為jogging弄破碗',
          '因為會打到人'
         ],
         ans: 3
      },
      {
         question: '為什麼最會烤肉的人是老師？',
         choices: [
          '老師很愛記過',
          '老師班會都在考試',
          '老師早自習都不來',
          '老師考的都不會教'
         ],
         ans: 4
      },
      {
         question: '我難過的是',
         choices: [
          '放棄你放棄愛',
          '把一個人的溫暖 轉移到另一個的胸膛',
          '指頭還殘留 妳為我 擦的指甲油',
          '我只能永遠讀著對白'
         ],
         ans: 1
      },
      {
         question: '下列誰曾經的學業成績排名百分比最高',
         choices: [
          '陳亭妤',
          '魏晧國',
          '黃政鈺',
          '黃祖寬'
         ],
         ans: 3
      },
      {
         question: '下雨天了怎麼辦',
         choices: [
          '撐傘',
          '淋雨',
          '我好想你',
          '漫步宇宙'
         ],
         ans: 3
      },
      {
         question: '新竹慈雲夜市的營業時間為',
         choices: [
          '每周一三',
          '每周二四',
          '每周一四',
          '每周二五'
         ],
         ans: 4
      },
      {
         question: '一杯飲料30元，大雄拿著60元請胖虎買飲料，請問他可以拿到幾杯飲料',
         choices: [
          '0',
          '1',
          '2',
          '3'
         ],
         ans: 1
      },
      {
         question: '一踏進這地方要幹嘛?',
         choices: [
          '要清楚誰是老大',
          '罩子最好放亮',
          '穿越金星木星水星火星土星追尋',
          '野'
         ],
         ans: 1
      },
      {
         question: '有人告訴你南大門的英文時，你該如何回答？',
         choices: [
          'South Gate',
          'North Gate',
          'NARUTO!!!',
          'I don\'t know'
         ],
         ans: 3
      },
      {
         question: '有一個白痴一直從飛機上丟行李下來，請問是為什麼',
         choices: [
          '因為外星人不會戴帽子',
          '因為你媽長得像魚人',
          '因為是將膽週年慶',
          '因為他是白痴'
         ],
         ans: 4
      },
      {
         question: '知名英雄聯盟實況主張家兄弟統神與國動，兄弟齊心，',
         choices: [
          '其力斷金。',
          '罵三字經。',
          '三百公斤。',
          '爬上菁英。'
         ],
         ans: 3
      },
      {
         question: 'Google首頁的兩個字母O分別是什麼顏色',
         choices: [
          '紅色/黃色',
          '黃色/藍色',
          '藍色/綠色',
          '綠色/紅色'
         ],
         ans: 1
      },
      ],
      '脂嗜份子': [
      {
         question: '赤燭遊戲的作品《還願》相當的夯，請問杜美心的生日是',
         choices: [
          '0716',
          '0616',
          '0516',
          '0416'
         ],
         ans: 1
      },
      {
         question: '華人最大電玩社群網站「巴哈姆特」，至今已邁入第幾年了',
         choices: [
          '8',
          '12',
          '19',
          '22'
         ],
         ans: 4
      },
      {
         question: '哪個國家曾在2000年禁止Xbox和Wii等外國遊戲在國內販售',
         choices: [
          '烏克蘭',
          '敘利亞',
          '西班牙',
          '中國'
         ],
         ans: 4
      },
      {
         question: '請問2019年Pokemon Go的5月社群日的主角是誰？',
         choices: [
          '穿山鼠',
          '走路草',
          '可達鴨',
          '火雉雞'
         ],
         ans: 4
      },
      {
         question: '請問憤怒鳥中共有幾種不同的小鳥？',
         choices: [
          '5',
          '7',
          '9',
          '11'
         ],
         ans: 4
      },
      {
         question: '請問楓之谷的自由市場每個頻道有幾個洞',
         choices: [
          '21',
          '22',
          '23',
          '24'
         ],
         ans: 2
      },
      {
         question: '請問韓國知名英雄聯盟職業選手Faker，使用劫反殺的成名之戰的對手是？',
         choices: [
          'Ambition',
          'Rookie',
          'Scout',
          'Ryu'
         ],
         ans: 4
      },
      {
         question: '請問急速領域中的暴風勇士是什麼等級的賽車？',
         choices: [
          'S',
          'A',
          'B',
          'C'
         ],
         ans: 3
      },
      {
         question: '請問爐石表演賽之王—羅傑，在今年的世界賽中沒帶哪套牌？',
         choices: [
          '炸彈戰',
          '機械聖',
          '節奏賊',
          '巨龍法'
         ],
         ans: 3
      },
      {
         question: '請問爐石戰記一副牌組通常由多少張卡牌組成？',
         choices: [
          '30',
          '40',
          '60',
          '80'
         ],
         ans: 1
      },
      {
         question: '請問魔物獵人裡被稱為公道伯的是哪隻龍？',
         choices: [
          '爆鱗龍',
          '櫻火龍',
          '滅盡龍',
          '飛雷龍'
         ],
         ans: 1
      },
      {
         question: '請問目前Pokemon Go下列何者沒有神奧進化？',
         choices: [
          '大舌頭',
          '呆呆獸',
          '狃拉',
          '毒薔薇'
         ],
         ans: 2
      },
      {
         question: '請問任天堂Switch是於何時在日本發售？',
         choices: [
          '2017/03/03',
          '2017/04/04',
          '2017/05/05',
          '2017/07/07'
         ],
         ans: 1
      },
      {
         question: '請問實況主 - 亞洲統神玩AD的勝率是幾%',
         choices: [
          '50%',
          '69%',
          '75%',
          '87%'
         ],
         ans: 3
      },
      {
         question: '請問實況主國棟「這什麼...到底什麼閃現？喔齁齁齁齁」的那場遊戲玩的是什麼英雄？',
         choices: [
          '燼',
          '寇格魔',
          '汎',
          '希維爾'
         ],
         ans: 2
      },
      {
         question: '請問是哪一隻角色的手可以穿過統神的巴巴?',
         choices: [
          '菲艾',
          '沃維克',
          '札克',
          '雷克薩'
         ],
         ans: 3
      },
      {
         question: '請問手遊急速領域中的地圖「時之沙」難度幾星？',
         choices: [
          '2星',
          '3星',
          '4星',
          '5星'
         ],
         ans: 2
      },
      {
         question: '請問台服英雄聯盟菁英牌位為積分前幾名的玩家？',
         choices: [
          '50',
          '100',
          '150',
          '200'
         ],
         ans: 4
      },
      {
         question: '請問下列何者不幫國動發大絕',
         choices: [
          '索拉卡',
          '極靈',
          '鏡爪',
          '凱爾'
         ],
         ans: 2
      },
      {
         question: '請問下列哪個遊戲不是Rockstar出的',
         choices: [
          '暴雪英霸',
          '碧血狂殺',
          '黑色洛城',
          '俠盜獵車手'
         ],
         ans: 1
      },
      {
         question: '請問下列在英雄聯盟中哪個英雄「不隸屬」於蒂瑪西亞',
         choices: [
          '汎',
          '杰西',
          '希瓦納',
          '凱爾'
         ],
         ans: 2
      },
      {
         question: '請問英雄聯盟選手FAKER的哪個冠軍造型賣得最好?',
         choices: [
          'SKT T1雷茲 ',
          'SKT T1星朵拉',
          'SKT T1劫',
          'SKT T1加里歐'
         ],
         ans: 2
      },
      {
         question: '請問英雄聯盟中哪一隻英雄Lv1的血量最少',
         choices: [
          '索拉卡',
          '艾妮維亞',
          '漢默丁格',
          '拉克絲'
         ],
         ans: 2
      },
      {
         question: '請問英雄聯盟中賽恩下巴的皇冠是誰的',
         choices: [
          '嘉文一世',
          '嘉文二世',
          '嘉文三世',
          '嘉文四世'
         ],
         ans: 1
      },
      {
         question: '請問在遊戲英雄聯盟中，下列誰不是初代台服三大劫神',
         choices: [
          '亞洲統神',
          'TOYZ',
          '楓堂歲月',
          '西門夜說'
         ],
         ans: 2
      },
      {
         question: '請問在召喚峽谷中要遊戲多久才可發起投降？',
         choices: [
          '10',
          '15',
          '20',
          '30'
         ],
         ans: 2
      },
      {
         question: '請問知名Facebook遊戲「Tetris Battle」在沒有Combo時，完美消除獲得的行數是多少？',
         choices: [
          '10',
          '11',
          '12',
          '13'
         ],
         ans: 1
      },
      {
         question: '下列何種線上遊戲沒有出手遊版本',
         choices: [
          '楓之谷',
          'Fortnite',
          '爆爆王',
          'SD鋼彈'
         ],
         ans: 4
      },
      {
         question: '下列哪款遊戲不屬於大逃殺FPS類型？',
         choices: [
          'PUBG',
          'Fortnite',
          'Apex Legend',
          'World War Z'
         ],
         ans: 4
      },
      {
         question: '下列哪位實況主不是台灣人',
         choices: [
          '餐餐自由配',
          'Toyz',
          '小草Yue',
          '嬌兔'
         ],
         ans: 2
      },
      {
         question: '在電腦發達的現代，人們常用電腦來玩遊戲，請問下列遊戲當中何者銷量最高',
         choices: [
          '當個創世神 Minecraft',
          '超級瑪莉歐兄弟 Super Mario Bros',
          '暗黑破壞神3 Diablo III',
          '俠盜獵車手5 GTA5'
         ],
         ans: 1
      },
      {
         question: '知名電玩大作「隻狼」，其遊戲作者為下列何者',
         choices: [
          '宮崎駿',
          '宮崎英高',
          '宮崎葵',
          '宮崎秋人'
         ],
         ans: 2
      },
      {
         question: '知名實況主「爆哥」以高超的跑跑卡丁車技術聞名，下列何種車款花了他約兩萬元？',
         choices: [
          '犽霸X',
          '阿緹密斯9',
          '毛筆X',
          '遊俠9'
         ],
         ans: 2
      },
      {
         question: '知名網頁遊戲Tetris Battle將在今年幾月幾號停止營運？',
         choices: [
          '5/31',
          '6/30',
          '7/31',
          '8/31'
         ],
         ans: 1
      },
      {
         question: '知名線上遊戲「新楓之谷」，其代理商為下列何者',
         choices: [
          '傳奇網路',
          '紅心辣椒',
          '遊戲橘子',
          'Garena'
         ],
         ans: 3
      },
      {
         question: '知名遊戲公司「任天堂」創立於哪一年？',
         choices: [
          '1889',
          '1963',
          '1977',
          '1990'
         ],
         ans: 1
      },
      {
         question: '知名遊戲「Minecraft」目前最新版本為',
         choices: [
          '1.12',
          '1.13',
          '1.14',
          '1.15'
         ],
         ans: 3
      },
      {
         question: 'Switch的精靈寶可夢go原價是多少？',
         choices: [
          '1590',
          '1690',
          '1790',
          '1890'
         ],
         ans: 3
      },
      ],
      '汁肆份子': [
      {
         question: '從圖書館前往一餐的路上有個涼亭，涼亭前的石碑上印著哪四個字?',
         choices: [
          '堅毅樸實',
          '飲水思源',
          '交通大學',
          '質實剛健'
         ],
         ans: 2
      },
      {
         question: '交大光復校區內，宿舍名稱上的數字總和是多少（ex: 研\'3\'，\'13\'舍...）',
         choices: [
          '69',
          '78',
          '72',
          '76'
         ],
         ans: 2
      },
      {
         question: '交大人氣美食「麥當勞」，能用學生證獲取以下哪種優惠？',
         choices: [
          '套餐送蛋捲冰淇淋',
          '套餐免費升級大薯',
          '所有品項八折',
          '所有品項九折'
         ],
         ans: 4
      },
      {
         question: '交大校內一共有幾間全家',
         choices: [
          '1',
          '2',
          '3',
          '4'
         ],
         ans: 3
      },
      {
         question: '凱傑打工需要送公文到「產學運籌中心」，請問他該前往下列何處',
         choices: [
          '行政大樓2樓',
          '科學一館1樓',
          '圖書館8樓',
          '交映樓7樓'
         ],
         ans: 3
      },
      {
         question: '每年清交大的盛事「梅竹賽」，起源於西元幾年',
         choices: [
          '1988',
          '1975',
          '1969',
          '1953'
         ],
         ans: 3
      },
      {
         question: '請問「電資大樓」前面的池塘叫什麼？',
         choices: [
          '小竹湖',
          '成功湖',
          '失敗胡',
          '沒有名字好嗎'
         ],
         ans: 4
      },
      {
         question: '請問「活中」與「7舍」中間的建築物名稱為何',
         choices: [
          '管理二館',
          '人社一館',
          '電資大樓',
          '人社三館'
         ],
         ans: 4
      },
      {
         question: '請問「交映樓」通常晚上幾點開燈/熄燈',
         choices: [
          '6點/12點',
          '6點/11點',
          '7點/11點',
          '7點/12點'
         ],
         ans: 4
      },
      {
         question: '請問「十三舍」總共有幾個出入口',
         choices: [
          '2',
          '3',
          '4',
          '5'
         ],
         ans: 3
      },
      {
         question: '請問2019世界紙飛機大賽交大資格賽，舉辦在下列哪個地點？',
         choices: [
          '活中B1聯誼廳',
          '綜一B1 L型',
          '中正堂B1聯誼廳',
          '交映樓1樓'
         ],
         ans: 1
      },
      {
         question: '請問9舍到以下何處距離「最近」',
         choices: [
          '操場',
          '中正堂',
          '工程一館',
          '科學二館'
         ],
         ans: 4
      },
      {
         question: '請問二餐「姐妹」的招牌飯是由什麼組成',
         choices: [
          '鹹豬肉+油雞+蝦捲',
          '鹹豬肉+香腸+油雞',
          '雪花豬+香腸+蝦捲',
          '雪花豬+香腸+油雞'
         ],
         ans: 3
      },
      {
         question: '請問工三跟工四哪一層沒有連在一起的',
         choices: [
          '一',
          '二',
          '三',
          '四'
         ],
         ans: 2
      },
      {
         question: '請問工三與工四之間的中庭在Pokémon go的補給站叫做什麼？',
         choices: [
          '工三中庭',
          '工三花園',
          '中庭景觀',
          '園林造景'
         ],
         ans: 4
      },
      {
         question: '請問浩然圖書館有幾層',
         choices: [
          '6',
          '7',
          '8',
          '9'
         ],
         ans: 4
      },
      {
         question: '請問環校速限是多少',
         choices: [
          '20',
          '30',
          '40',
          '50'
         ],
         ans: 1
      },
      {
         question: '請問交大到台北車站的直線距離大約是多少公里?',
         choices: [
          '60',
          '80',
          '100',
          '150'
         ],
         ans: 1
      },
      {
         question: '請問交大的出納組在什麼地方',
         choices: [
          '中正堂一樓',
          '中正堂二樓',
          '行政大樓一樓',
          '行政大樓二樓'
         ],
         ans: 2
      },
      {
         question: '請問交大的傳科系是隸屬於哪個學院',
         choices: [
          '人文社會學院',
          '傳播科技學院',
          '傳統科學學院',
          '客家文化學院'
         ],
         ans: 4
      },
      {
         question: '請問交大怪鳥的名字是甚麼',
         choices: [
          '黃頸黑鷺',
          '黑冠麻鷺',
          '赤腹山雀',
          '笨鳥'
         ],
         ans: 2
      },
      {
         question: '請問交大光復校區地址為新竹市東區大學路幾號？',
         choices: [
          '1011',
          '101',
          '1001',
          '109'
         ],
         ans: 3
      },
      {
         question: '請問交大光復校區內有幾台「郵局」的ATM提款機',
         choices: [
          '2',
          '3',
          '4',
          '5'
         ],
         ans: 3
      },
      {
         question: '請問交大光復校區游泳館，將於哪一天的06:00~13:00進行保養暫停開放？',
         choices: [
          '5/31(五)',
          '6/3(一)',
          '6/5(三)',
          '6/7(五)'
         ],
         ans: 2
      },
      {
         question: '請問交大漢堡王是幾月開幕的？',
         choices: [
          '2018/11',
          '2018/12',
          '2019/01',
          '2019/02'
         ],
         ans: 1
      },
      {
         question: '請問交大浩然圖書館的辦公處在幾樓',
         choices: [
          'B1',
          '1樓',
          '2樓',
          '3樓'
         ],
         ans: 2
      },
      {
         question: '請問交大米克Q的炸物哪天沒有供應',
         choices: [
          '星期二',
          '星期三',
          '星期四',
          '星期五'
         ],
         ans: 4
      },
      {
         question: '請問交大體育館內有幾個室內籃球場(全場)',
         choices: [
          '0',
          '1',
          '2',
          '3'
         ],
         ans: 3
      },
      {
         question: '請問交大校內共有幾個Ubike站？',
         choices: [
          '1',
          '2',
          '3',
          '4'
         ],
         ans: 2
      },
      {
         question: '請問交大有幾個排球場',
         choices: [
          '5',
          '6',
          '7',
          '8'
         ],
         ans: 3
      },
      {
         question: '請問交大有幾個學系',
         choices: [
          '20',
          '21',
          '22',
          '23'
         ],
         ans: 1
      },
      {
         question: '請問交大在2016年底為了培訓什麼階段的資安人才成立「亥客書院」？',
         choices: [
          '高中生',
          '大專生',
          '研究生',
          '在職人員'
         ],
         ans: 4
      },
      {
         question: '請問交大增設什麼學士學位作為多元特殊選才的管道？',
         choices: [
          '繁星',
          '拾穗',
          '成星',
          '百川'
         ],
         ans: 4
      },
      {
         question: '請問交通大學的校徽中書上的英文字由左至右為何?',
         choices: [
          'ESA',
          'EAS',
          'SEA',
          'SAE'
         ],
         ans: 1
      },
      {
         question: '請問今年的梅竹賽沒有什麼項目',
         choices: [
          '排球',
          '籃球',
          '橋牌',
          '撞球'
         ],
         ans: 1
      },
      {
         question: '請問女二饕爺燒臘每天都很快被搶完的「鴨腿飯」賣多少錢？',
         choices: [
          '95',
          '90',
          '85',
          '80'
         ],
         ans: 1
      },
      {
         question: '請問人社二館是哪個系的系館',
         choices: [
          '外文',
          '人社',
          '傳科',
          '管科'
         ],
         ans: 1
      },
      {
         question: '請問下列何者交大科系不屬於理學院',
         choices: [
          '生物科技學系',
          '電子物理學系',
          '應用數學系',
          '應用化學系'
         ],
         ans: 1
      },
      {
         question: '請問下列哪個建築物各大「友會」最愛用',
         choices: [
          '工程三館',
          '工程四館',
          '工程五館',
          '管理二館'
         ],
         ans: 1
      },
      {
         question: '請問下列哪個校狗instagram追蹤人數最多？',
         choices: [
          '交大的小白（豆漿）',
          '卡布你搞什麼東西（ㄎㄧㄤ布）',
          '十三姨（請勿摸我）',
          '牛排（芝麻）'
         ],
         ans: 1
      },
      {
         question: '請問下列哪個學餐沒有滷味店？',
         choices: [
          '一餐',
          '二餐',
          '研三',
          '以上都有'
         ],
         ans: 2
      },
      {
         question: '請問下列哪一門通識課上課地點不是綜合一館',
         choices: [
          '馬克思學說之析評',
          '幾何造型',
          '音樂理論導論',
          '心理學概論'
         ],
         ans: 2
      },
      {
         question: '請問小紅巴沒有停在哪一站',
         choices: [
          '竹湖',
          '綜合一館',
          '計網中心',
          '交大棒球場'
         ],
         ans: 2
      },
      {
         question: '請問小七/全家打幾折',
         choices: [
          '88/85',
          '85/85',
          '88/88',
          '9/85'
         ],
         ans: 1
      },
      {
         question: '請問新竹2路公車從交大光復行駛的班次中，哪一個時段的會繞行建功路',
         choices: [
          '07:25',
          '08:40',
          '09:20',
          '11:10'
         ],
         ans: 2
      },
      {
         question: '請問在交大校園內的何處可以搭乘「豪泰客運」？',
         choices: [
          '中正堂前',
          '研三舍前',
          '工六停車場',
          '小木屋前'
         ],
         ans: 3
      },
      {
         question: '請問中午十二點過後「交大學生」使用溫水游泳池要多少錢？',
         choices: [
          '免費',
          '20元',
          '30元',
          '40元'
         ],
         ans: 4
      },
      {
         question: '下列何者「並非」交大熱舞社有的舞風？',
         choices: [
          'Popping',
          'Jazz',
          'House',
          'Breaking'
         ],
         ans: 2
      },
      {
         question: '下列何者在「2019年交大雲嘉周：古人雲嘉奔皇帝大」中買不到',
         choices: [
          '蛋捲',
          '乳酪條',
          '奶酪',
          '麻糬'
         ],
         ans: 4
      },
      {
         question: '以下社團何者不在交大社團中？',
         choices: [
          '蛋糕社',
          '馬術社',
          '溜溜球社',
          '彩妝保養社'
         ],
         ans: 3
      },
      ],
      '知史份子': [
      {
         question: '「竹風蘭雨」形容新竹的冬季多風， 宜蘭的冬季多雨，形成這種現象的重要因素為何？ ',
         choices: [
          '緯度',
          '地形',
          '洋流',
          '季風'
         ],
         ans: 4
      },
      {
         question: '二戰時，英法聯軍遭到德軍包圍，英國最後奇蹟救回大量的人，請問這場戰役叫什麼',
         choices: [
          '諾曼第大空降',
          '敦克爾克戰役',
          '中途島海戰',
          '史達林格勒會戰'
         ],
         ans: 2
      },
      {
         question: '歷史上有名的秦始皇做了許多政績，下列何者「不是」發生在他任內',
         choices: [
          '焚書坑儒',
          '安史之亂',
          '郡縣制',
          '統一度量衡'
         ],
         ans: 2
      },
      {
         question: '每年的11月至次年2月是到「印度」旅遊的旺季，請問是什麼原因',
         choices: [
          '氣候乾爽宜人',
          '天然災害較少',
          '佛教祭典頻繁',
          '恆河比較乾淨'
         ],
         ans: 1
      },
      {
         question: '美國籍的諾貝爾經濟學獎得主受臺灣企業邀請前來演講，其演講費應列入？',
         choices: [
          '僅列入本國GDP',
          '僅列入本國GNP',
          '列入本國GDP與GNP',
          '兩者都不列入'
         ],
         ans: 1
      },
      {
         question: '齊睿暑假想坐船回澎湖老家，請問他可以到哪裡搭船到澎湖？',
         choices: [
          '台中港',
          '基隆港',
          '布袋港',
          '台北港'
         ],
         ans: 3
      },
      {
         question: '請灣台灣第9屆立法院的總席次共有幾席',
         choices: [
          '112',
          '113',
          '114',
          '115'
         ],
         ans: 2
      },
      {
         question: '請問「北回歸線」通過台灣多少個縣市?',
         choices: [
          '4',
          '5',
          '6',
          '7'
         ],
         ans: 3
      },
      {
         question: '請問「春秋五霸」不包含下列何者？',
         choices: [
          '齊桓公',
          '宋文公',
          '秦穆公',
          '楚莊王'
         ],
         ans: 2
      },
      {
         question: '請問「湄公河」的起源地為下列哪個國家',
         choices: [
          '泰國',
          '柬埔寨',
          '越南',
          '中國'
         ],
         ans: 4
      },
      {
         question: '請問「美國矽谷」的氣候屬於下列何者?',
         choices: [
          '溫帶沙漠',
          '溫帶大陸',
          '溫帶地中海',
          '溫帶海洋'
         ],
         ans: 3
      },
      {
         question: '請問「月亮蝦餅」最初是產自哪裡呢',
         choices: [
          '台灣',
          '緬甸',
          '越南',
          '泰國'
         ],
         ans: 1
      },
      {
         question: '請問大家常說的「左岸咖啡」是在哪一條河的左岸',
         choices: [
          '萊茵河',
          '多瑙河',
          '塞納河',
          '泰晤士河'
         ],
         ans: 3
      },
      {
         question: '請問東北「新三寶」不包含下列何者？',
         choices: [
          '人參',
          '貂皮',
          '烏拉草',
          '鹿茸'
         ],
         ans: 3
      },
      {
         question: '請問俄國「海森威港」不會結凍的主因為?',
         choices: [
          '暖流通過',
          '太平洋鹽分較高',
          '俄國用核能加熱海水',
          '緯度較低'
         ],
         ans: 4
      },
      {
         question: '請問紅綠燈裡的「小綠人」是哪個國家首先研發的呢',
         choices: [
          '丹麥',
          '德國',
          '台灣',
          '日本'
         ],
         ans: 3
      },
      {
         question: '請問目前台灣「公投法定年齡」是幾歲？',
         choices: [
          '16歲',
          '18歲',
          '19歲',
          '20歲'
         ],
         ans: 2
      },
      {
         question: '請問目前台灣政黨輪替了幾次',
         choices: [
          '2',
          '3',
          '4',
          '5'
         ],
         ans: 2
      },
      {
         question: '請問歐洲「多瑙河」的發源地是下列何處',
         choices: [
          '德國',
          '奧地利',
          '匈牙利',
          '保加利亞'
         ],
         ans: 1
      },
      {
         question: '請問台三線「沒有」經過哪裡?',
         choices: [
          '台北市',
          '彰化縣',
          '南投縣',
          '屏東縣'
         ],
         ans: 2
      },
      {
         question: '請問台灣目前有多少邦交國',
         choices: [
          '16',
          '17',
          '19',
          '20'
         ],
         ans: 2
      },
      {
         question: '請問台灣山脈中的最高峰，何者高度第二高？',
         choices: [
          '玉山山脈',
          '雪山山脈',
          '中央山脈',
          '阿里山山脈'
         ],
         ans: 2
      },
      {
         question: '請問台灣是亞洲第幾個婚姻平權的國家？',
         choices: [
          '1',
          '2',
          '3',
          '69'
         ],
         ans: 1
      },
      {
         question: '請問台灣在2009年發放給全國人民的「消費券」金額是多少',
         choices: [
          '2400元',
          '3600元',
          '3000元',
          '4800元'
         ],
         ans: 2
      },
      {
         question: '請問我們現今最常使用的「阿拉伯數字」是甚麼人發明的呢',
         choices: [
          '阿拉伯人',
          '猶太人',
          '歐洲人',
          '印度人'
         ],
         ans: 4
      },
      {
         question: '請問下列地點何者距離台灣最遠',
         choices: [
          '阿根廷 布林諾斯艾利斯',
          '巴拉圭 雅松森',
          '烏拉圭 蒙德維的雅',
          '玻利維亞 蘇克雷'
         ],
         ans: 2
      },
      {
         question: '請問下列國家哪個國土「面積最大」',
         choices: [
          '哈薩克',
          '印度',
          '阿根廷',
          '阿爾及利亞'
         ],
         ans: 2
      },
      {
         question: '請問下列何者「不是」台灣的軍艦',
         choices: [
          '海龍號',
          '海虎號',
          '海豹號',
          '海王號'
         ],
         ans: 4
      },
      {
         question: '請問下列何者是三國劉備手下的「五虎將」之一？',
         choices: [
          '魏延',
          '廖化',
          '姜維',
          '黃忠'
         ],
         ans: 4
      },
      {
         question: '請問下列何者算是台灣「南部」',
         choices: [
          '台南',
          '台中',
          '新竹',
          '以上皆是'
         ],
         ans: 1
      },
      {
         question: '請問下列哪個「不在」桃園',
         choices: [
          '石門水庫',
          '拉拉山',
          '武陵農場',
          '統領百貨'
         ],
         ans: 3
      },
      {
         question: '請問下列哪個國家「沒有」被殖民的歷史?',
         choices: [
          '加拿大',
          '泰國',
          '澳洲',
          '南非'
         ],
         ans: 2
      },
      {
         question: '請問下列哪一個國家跟台灣在同一個時區？',
         choices: [
          '汶萊',
          '東帝汶',
          '越南',
          '帛琉'
         ],
         ans: 1
      },
      {
         question: '請問下列職務何者是不存在的?',
         choices: [
          '高雄市政府民政局局長',
          '高雄市政府經發局局長',
          '高雄市政府捷運局局長',
          '高雄市政府社福局局長'
         ],
         ans: 4
      },
      {
         question: '請問新竹從來「沒有」下列哪個稱呼？',
         choices: [
          '竹塹城',
          '淡水廳城',
          '新竹城',
          '府城'
         ],
         ans: 4
      },
      {
         question: '請問義大利國旗「從左至右」是什麼顏色',
         choices: [
          '紅白黃',
          '紅白綠',
          '紅綠白',
          '綠白紅'
         ],
         ans: 4
      },
      {
         question: '請問擁有最多妃子的清朝皇帝是?',
         choices: [
          '康熙',
          '雍正',
          '乾隆',
          '嘉慶'
         ],
         ans: 1
      },
      {
         question: '日本戰國時期發生的「本能寺之變」是下列何者叛變，討伐織田信長？',
         choices: [
          '柴田勝家',
          '德川家康',
          '羽柴秀吉',
          '明智光秀'
         ],
         ans: 4
      },
      {
         question: '俗稱：三月瘋媽祖，四月迎______?',
         choices: [
          '王爺',
          '虎爺',
          '菩薩',
          '文昌'
         ],
         ans: 1
      },
      {
         question: '台北市規定須購買專用垃圾袋來處理垃圾，否則清潔隊不清運，請問此措施的主要動機為',
         choices: [
          '刺激民間消費',
          '減緩景氣波動',
          '將外部成本內部化',
          '改善政府財政問題'
         ],
         ans: 3
      },
      {
         question: '台灣清治時期三大民變事件「不包含」下列何者',
         choices: [
          '林爽文事件',
          '戴潮春事件',
          '朱一貴事件',
          '施九緞事件'
         ],
         ans: 4
      },
      {
         question: '西班牙南部有公司要擴張，想找文化語言和氣候相似的地區，請問下列哪個地區較合適',
         choices: [
          '智利中部',
          '澳洲西南部',
          '菲律賓南部',
          '哥倫比亞北部'
         ],
         ans: 1
      },
      {
         question: '西元1831年12月達爾文搭乘下列哪一艘船，前往南美洲從事自然調查研究工作？',
         choices: [
          '小狼犬號',
          '小獵犬號',
          '波斯貓號',
          '野貓號'
         ],
         ans: 2
      },
      {
         question: '下列何者「不是」開台始祖鄭成功的別稱',
         choices: [
          '延平郡王',
          'Leo王',
          '潮武王',
          '開山王'
         ],
         ans: 2
      },
      {
         question: '下列哪一個不是「南歐三大半島」？',
         choices: [
          '伊比利亞半島',
          '亞平寧半島',
          '巴爾幹半島',
          '克里米亞半島'
         ],
         ans: 4
      },
      {
         question: '許多大學生畢旅會出國，參觀各式各樣有名的景點，請問下列哪個建築物最高',
         choices: [
          '東京晴空塔',
          '上海中心大廈',
          '101大樓',
          '艾菲爾鐵塔'
         ],
         ans: 1
      },
      {
         question: '一部小說內容提到資本家消失、人人可依興趣工作、土地工廠公有等，請問最可能是描述？',
         choices: [
          '十二世紀西歐的莊園',
          '十七世紀的自由主義',
          '十九世紀的社會主義',
          '二十世紀的帝國主義'
         ],
         ans: 3
      },
      {
         question: '以歷史角度來看，到中美州大部分國家旅行，和當地住民溝通，用哪種語言最方便？',
         choices: [
          '西班牙語',
          '法語',
          '英語',
          '葡萄牙語'
         ],
         ans: 1
      },
      {
         question: '在母親節，康乃馨是台灣兒女送給母親的代表花，那麼泰國兒女送什麼花給母親？',
         choices: [
          '康乃馨',
          '牡丹花',
          '茉莉花',
          '百合花'
         ],
         ans: 3
      },
      {
         question: '知名景點「民雄鬼屋」以恐怖陰森聞名，請問下列何者是「民雄」的古稱?',
         choices: [
          '打貓',
          '打狗',
          '猴樹港',
          '猿江'
         ],
         ans: 1
      },
      ],
      '知事份子': [
      {
         question: '2018年底的縣市長大選，請問台北市候選人丁守中以幾票之差落敗給柯文哲？',
         choices: [
          '6712',
          '3254',
          '10355',
          '36774'
         ],
         ans: 2
      },
      {
         question: '2019年5月，1000、5000、10000圓的日幣換上新鈔。請問10000日圓上的新面孔是誰？',
         choices: [
          '福澤諭吉',
          '澀澤榮一',
          '津田梅子',
          '北里柴三郎'
         ],
         ans: 2
      },
      {
         question: '2019年初，Deepmind團隊的AI於哪一款遊戲，以10:1的成績擊敗兩位職業選手',
         choices: [
          '爐石戰記',
          '星海爭霸2',
          '世紀帝國2',
          '英雄聯盟'
         ],
         ans: 2
      },
      {
         question: '2019年舉辦在高雄市的「春吶」吸引了許多攤販進駐，請問這些攤販總共賣出了多少香腸',
         choices: [
          '6000',
          '2000',
          '48',
          '4'
         ],
         ans: 4
      },
      {
         question: '2019年母親節的正確日期是?',
         choices: [
          '5/5',
          '5/8',
          '5/12',
          '5/15'
         ],
         ans: 3
      },
      {
         question: '川普的推特造成股市波動，根據媒體統計川普的推文平均每個字為多少美元？',
         choices: [
          '1億美元',
          '75億美元',
          '130美元',
          '210美元'
         ],
         ans: 3
      },
      {
         question: '第72屆世界衛生大會（WHA）於下列哪一國家開幕？',
         choices: [
          '瑞士日內瓦',
          '英國倫敦',
          '法國波爾多 ',
          '荷蘭鹿特丹'
         ],
         ans: 1
      },
      {
         question: '法國的「黃背心運動」主要是抗議馬克宏政府調高哪一項稅率？',
         choices: [
          '富人稅',
          '燃油稅',
          '數位稅',
          '增值稅'
         ],
         ans: 2
      },
      {
         question: '國民黨高雄市長候選人韓國瑜最近在網路上被鄉民取了許多綽號，請問下列哪一個不是有關他的綽號？',
         choices: [
          '屁眼俠',
          '國瑜種子',
          '夜襲',
          '韓極混'
         ],
         ans: 3
      },
      {
         question: '近日，衛福部「世衛行動團」臉書公布「TTT」計畫，請問此「TTT」計畫的全名是？',
         choices: [
          'Taiwan Transcatheter Therapeutics',
          'Taiwan Tech Trek',
          'Train The Trainer',
          'Team Time Trial'
         ],
         ans: 3
      },
      {
         question: '美國總統川普在2019宣布承認以色列在哪裡的主權，引起全球譁然',
         choices: [
          '加薩走廊',
          '耶路撒冷',
          '戈蘭高地',
          '西奈半島'
         ],
         ans: 3
      },
      {
         question: '紐西蘭恐怖攻擊的兇手，在犯案前在網路上發布了以下哪個作戰宣言？',
         choices: [
          '大代替',
          '白人至上',
          '反移民',
          '新世代'
         ],
         ans: 1
      },
      {
         question: '紐西蘭恐怖攻擊事發生在哪個城市?',
         choices: [
          '基督城',
          '皇后鎮',
          '但尼丁',
          '奧克蘭'
         ],
         ans: 1
      },
      {
         question: '歐洲南方天文台最近公布了人類首次拍到的黑洞照片，請問這個黑洞的名字是',
         choices: [
          'Powehi',
          'Marika',
          'Karl',
          'Palakila'
         ],
         ans: 1
      },
      {
         question: '拍攝出人類史上第一次黑洞照片的計畫《事件視界望遠鏡(EHT)》沒有使用以下哪個望遠鏡？',
         choices: [
          '智利 ALMA',
          '南極 SPT',
          '美國 VLA',
          '墨西哥 LMT'
         ],
         ans: 3
      },
      {
         question: '請問「司法院釋字第748號解釋施行法」將於何日實施？',
         choices: [
          '2019/5/24',
          '2019/5/27',
          '2019/6/1',
          '2020/1/1'
         ],
         ans: 1
      },
      {
         question: '請問108大學學測的國文作文題目是下列何者?',
         choices: [
          '我們這個世代',
          '溫暖的心',
          '接納',
          '壑'
         ],
         ans: 2
      },
      {
         question: '請問2019年建築大師貝聿銘以幾歲辭世？',
         choices: [
          '88',
          '98',
          '100',
          '102'
         ],
         ans: 4
      },
      {
         question: '請問2019年英雄聯盟MSI季中邀請賽的冠軍隊伍為何',
         choices: [
          'TL',
          'SKT T1',
          'G2',
          'IG'
         ],
         ans: 3
      },
      {
         question: '請問4/24上映的電影「復仇者聯盟4：終局之戰」是漫威宇宙的第幾部電影？',
         choices: [
          '19',
          '20',
          '21',
          '22'
         ],
         ans: 4
      },
      {
         question: '請問冰島二氧化碳封存技術是將氣體打入什麼岩石中？',
         choices: [
          '安山岩',
          '玄武岩',
          '石灰岩',
          '花崗岩'
         ],
         ans: 2
      },
      {
         question: '請問蔡英文總統在臉書上稱自己和支持者為什麼派？',
         choices: [
          '英文派',
          '小英派',
          '嗆台派',
          '辣台派'
         ],
         ans: 4
      },
      {
         question: '請問常出現在同志遊行中的六色彩虹旗，其顏色與意義之配對下列何者不正確？',
         choices: [
          '紅：life',
          '橙：spirit',
          '黃：sunlight',
          '綠：nature'
         ],
         ans: 2
      },
      {
         question: '請問高雄自經區是？',
         choices: [
          '就是讓台中發大財啊',
          '就是讓台北發大財啊',
          '就是讓台南發大財啊',
          '就是讓高雄發大財啊'
         ],
         ans: 4
      },
      {
         question: '請問谷關長年來以什麼聞名?',
         choices: [
          '空氣',
          '溫泉',
          '咖啡',
          '慶記'
         ],
         ans: 2
      },
      {
         question: '請問即將與交大合併的陽明大學現任校長為下列何者？',
         choices: [
          '管中閔',
          '郭旭崧',
          '賀陳弘',
          '蘇慧貞'
         ],
         ans: 2
      },
      {
         question: '請問近日美國對中國的懲罰性關稅提高了幾個百分比？',
         choices: [
          '10',
          '15',
          '20',
          '25'
         ],
         ans: 2
      },
      {
         question: '請問近日美國下列哪一州通過了「美國最嚴格墮胎法令」？',
         choices: [
          '阿拉巴馬',
          '佛羅里達',
          '德州',
          '賓夕法尼亞'
         ],
         ans: 1
      },
      {
         question: '請問去年新北樹林新建了什麼，導致廣大迴響',
         choices: [
          '威秀影城',
          '大遠百',
          '秀泰影城',
          'Costco'
         ],
         ans: 3
      },
      {
         question: '請問斯里蘭卡恐攻發生在什麼節日，所以造成大量死亡？',
         choices: [
          '復活節',
          '開齋節',
          '七旬節',
          '屠妖節'
         ],
         ans: 1
      },
      {
         question: '請問台灣人去下列哪個國家需要簽證？',
         choices: [
          '日本',
          '美國',
          '新加坡',
          '泰國'
         ],
         ans: 4
      },
      {
         question: '請問五月公布的金曲獎入圍名單之中，饒舌歌手OZI入圍了幾項獎項',
         choices: [
          '3',
          '4',
          '5',
          '6'
         ],
         ans: 4
      },
      {
         question: '請問習近平在一帶一路演講上疑似將「精湛」讀作下列何者？',
         choices: [
          '精緻',
          '精廣',
          '精實',
          '精甚'
         ],
         ans: 4
      },
      {
         question: '請問下列哪個東西郭台銘沒吃過',
         choices: [
          '草',
          '飯',
          '麵',
          '土'
         ],
         ans: 4
      },
      {
         question: '請問下列哪個顏色不是IPhone XR有出的顏色？',
         choices: [
          '藍色',
          '珊瑚色',
          '黃色',
          '橘色'
         ],
         ans: 3
      },
      {
         question: '請問下列哪一個公司將凍結與華為的合作關係？',
         choices: [
          '英特爾',
          'google',
          '高通',
          '以上皆是'
         ],
         ans: 4
      },
      {
         question: '請問香奈兒的創意總監「時尚大帝」卡爾·拉格斐享年幾歲?',
         choices: [
          '90',
          '85',
          '80',
          '75'
         ],
         ans: 2
      },
      {
         question: '請問知名電視劇「我們與惡的距離」中的角色宋喬平，是下列哪位演員飾演的？',
         choices: [
          '賈靜雯',
          '周采詩',
          '陳妤',
          '林予晞'
         ],
         ans: 4
      },
      {
         question: '請問知名網路節目木曜四超玩的「一日系列」於5/16日發布的最新一集為此系列第幾集',
         choices: [
          '67',
          '81',
          '93',
          '100'
         ],
         ans: 4
      },
      {
         question: '請問最近波音被停飛的飛機是？',
         choices: [
          '737',
          '747',
          '737 MAX',
          '747 MAX'
         ],
         ans: 3
      },
      {
         question: '請問最近日本更換的新年號為何？',
         choices: [
          '令和',
          '万和',
          '久化',
          '万保'
         ],
         ans: 1
      },
      {
         question: '熱門訂餐APP「FoodPanda」沒有在哪個縣市服務',
         choices: [
          '台南',
          '高雄',
          '新竹',
          '桃園'
         ],
         ans: 1
      },
      {
         question: '日本首間「MUJI HOTEL」世界旗艦店「無印良品銀座」4月4日於東京銀座正式開幕！請問它是位於東京23區的哪一區？',
         choices: [
          '足立區',
          '品川區',
          '新宿區',
          '中央區'
         ],
         ans: 4
      },
      {
         question: '因為巴黎聖母院大火，法國遊戲公司育碧決定在什麼期間免費贈送遊戲《刺客教條》?',
         choices: [
          '4/15 - 4/23',
          '4/16 - 4/24',
          '4/17 - 4/25',
          '4/18 - 4/26'
         ],
         ans: 3
      },
      {
         question: '印度大選被稱為地表上最大的民主盛事，總共有9億選民，請問整場選舉為期多久',
         choices: [
          '41天',
          '40天',
          '39天',
          '38天'
         ],
         ans: 3
      },
      {
         question: '英國脫歐問題未解，請問民眾對脫歐黨丟什麼食物表達抗議？',
         choices: [
          '奶昔',
          '雞蛋',
          '薯條',
          '汽水'
         ],
         ans: 1
      },
      {
         question: '知名美劇「冰與火之歌」目前出到第幾季？',
         choices: [
          '6',
          '7',
          '8',
          '9'
         ],
         ans: 3
      },
      {
         question: '直至2019年，台灣已經幾年沒受邀世界衛生大會（WHA) ?',
         choices: [
          '1',
          '2',
          '3',
          '4'
         ],
         ans: 3
      },
      {
         question: '最近日本新上任的天皇是？',
         choices: [
          '明仁',
          '德仁',
          '裕仁',
          '嘉仁'
         ],
         ans: 2
      },
      {
         question: '最近非洲豬瘟的疫情受到世界各地的關注，請問非洲豬瘟是何時在中國爆發的？',
         choices: [
          '2018年6月',
          '2018年8月',
          '2018年10月',
          '2018年12月'
         ],
         ans: 2
      },
      ],
      '姿勢份子': [
      {
         question: '2003年棒球亞錦賽中華對南韓，中華隊某球員打出再見安打，讓主播高喊「又是xxx !」，這個球員是？',
         choices: [
          '張泰山',
          '彭政閔',
          '林智勝',
          '高志綱'
         ],
         ans: 4
      },
      {
         question: '2018年美國職棒大聯盟MLB的冠軍為下列哪支球隊?',
         choices: [
          '太空人',
          '釀酒人',
          '紅襪',
          '道奇'
         ],
         ans: 3
      },
      {
         question: '棒球規則中，若安打彈地後彈出全壘打牆，則視為？',
         choices: [
          '全壘打',
          '界外球',
          '三壘安打',
          '二壘安打'
         ],
         ans: 4
      },
      {
         question: '高爾夫球中，下列何者「不是」低於標準桿三桿的別稱',
         choices: [
          '雙鷹球（double eagle）',
          '鳳凰（Phoenix）',
          '信天翁（albatross）',
          '金鷹（golden eagle）'
         ],
         ans: 2
      },
      {
         question: '請問「半程馬拉松」的總長度是多少公里',
         choices: [
          '21.0975',
          '20.9875',
          '21.0455',
          '21.0875'
         ],
         ans: 1
      },
      {
         question: '請問「個人混合泳」比賽項目中，第一個泳姿規定是？',
         choices: [
          '蝶泳',
          '仰泳',
          '蛙泳',
          '自由式'
         ],
         ans: 1
      },
      {
         question: '請問「水上芭蕾」的英文為何？',
         choices: [
          'artistic swimming',
          'water ballet',
          'tsunami',
          'scuba diving'
         ],
         ans: 1
      },
      {
         question: '請問「有舵雪橇」何時成為冬季奧運的正式項目？',
         choices: [
          '西元1918年',
          '西元1924年',
          '西元1944年',
          '西元1950年'
         ],
         ans: 2
      },
      {
         question: '羽球場的界線不同一條，請問「羽球單打」時，左右跟前後的界線為何？',
         choices: [
          '左右寬 前後長',
          '左右寬 前後短',
          '左右窄 前後長',
          '左右窄 前後短'
         ],
         ans: 3
      },
      {
         question: '請問「F1賽車」中的 F 是哪個單字的縮寫？',
         choices: [
          'Formula',
          'Final',
          'Fortunate',
          'Forever'
         ],
         ans: 1
      },
      {
         question: '請問棒球術語中的「敬遠球」代表甚麼',
         choices: [
          '故意四壞球保送',
          '內野安打',
          '全壘打',
          '暴投'
         ],
         ans: 1
      },
      {
         question: '請問棒球選手「柏融大王」現在是哪一隊球員',
         choices: [
          'Lamigo桃猿',
          '中信兄弟',
          '台灣啤酒',
          '日本火腿'
         ],
         ans: 4
      },
      {
         question: '請問飛鏢中，301跟501的模式裡「單鏢」最多可以拿到幾分？',
         choices: [
          '25',
          '30',
          '50',
          '60'
         ],
         ans: 4
      },
      {
         question: '請問洛杉磯「不具有」下列哪支球隊？',
         choices: [
          '湖人隊',
          '道奇隊',
          '天使隊',
          '艦艇隊'
         ],
         ans: 4
      },
      {
         question: '請問美式足球中，「達陣」會得幾分？',
         choices: [
          '1',
          '2',
          '3',
          '6'
         ],
         ans: 4
      },
      {
         question: '請問熱火知名球星閃電俠「韋德」的英文名字怎麼拼',
         choices: [
          'Dwayne Wade',
          'Dywane Wade',
          'Dwane Wade',
          'Dwyane Wade'
         ],
         ans: 4
      },
      {
         question: '請問田徑世界百米紀錄保持人「Usain Bolt」是來自哪個國家？',
         choices: [
          '巴拿馬',
          '古巴',
          '尼加拉瓜',
          '牙買加'
         ],
         ans: 4
      },
      {
         question: '請問網球的最終局比數不可能為何？',
         choices: [
          '6:5',
          '6:4',
          '7:5',
          '7:6'
         ],
         ans: 1
      },
      {
         question: '請問下列何者「沒有」拿過NBA總冠軍賽的FMVP',
         choices: [
          '杜蘭特',
          '伊古達拉',
          '柯瑞',
          '喇叭詹'
         ],
         ans: 3
      },
      {
         question: '請問下列何者是2016里約奧運時沒被列入，但在2020東京奧運重返名單的比賽項目',
         choices: [
          '棒球',
          '馬術',
          '柔道',
          '拳擊'
         ],
         ans: 1
      },
      {
         question: '請問以下哪位NBA球員「沒有」進入今年的例行賽mvp的候選名單內？',
         choices: [
          '勇士死神杜蘭特',
          '公鹿老大字母哥',
          '火箭飯飯哈登',
          '雷霆希望喬治'
         ],
         ans: 1
      },
      {
         question: '請問在「合球」中，一隊中規定為幾男幾女？',
         choices: [
          '六男二女',
          '四男四女',
          '全男',
          '隨意'
         ],
         ans: 2
      },
      {
         question: '請問在保齡球術語中，連續三次全倒叫什麼？',
         choices: [
          '一條龍',
          '火雞',
          '鳳凰',
          '獨角獸'
         ],
         ans: 2
      },
      {
         question: '請問正式射箭比賽中，中心的顏色是什麼呢？',
         choices: [
          '藍色',
          '黃色',
          '紅色',
          '黑色'
         ],
         ans: 2
      },
      {
         question: '請問知名職業網球選手「Roger Federer」生涯共拿過幾個大滿貫冠軍？',
         choices: [
          '16',
          '18',
          '20',
          '22'
         ],
         ans: 3
      },
      {
         question: '請問撞球的「8號球」通常是什麼顏色',
         choices: [
          '黑色',
          '黃色',
          '紅色',
          '咖啡色'
         ],
         ans: 1
      },
      {
         question: '請問桌球桌的國際標準大小是多少公尺？',
         choices: [
          '長2.74、寬1.525',
          '長3.12、寬1.617',
          '長2.91、寬1.745',
          '長2.56、寬1.418'
         ],
         ans: 1
      },
      {
         question: '請問NBA球星「Lebron James」總共轉隊過幾次',
         choices: [
          '1次',
          '2次',
          '3次',
          '4次'
         ],
         ans: 3
      },
      {
         question: '請問Zaza於2017/5/14西區決賽第一場時因為伸出哪隻腳導致kawhi的哪隻腳受傷？',
         choices: [
          '右/右',
          '右/左',
          '左/右',
          '左/左'
         ],
         ans: 4
      },
      {
         question: '田徑賽分為田賽和徑賽，請問下列何者不屬於「田賽」？',
         choices: [
          '跨欄跑',
          '射標槍',
          '跳遠',
          '擲鉛球'
         ],
         ans: 1
      },
      {
         question: '下列何者「不是」豪神林書豪待過的球隊',
         choices: [
          '金州勇士',
          '休士頓火箭',
          '亞特蘭大老鷹',
          '波士頓賽爾提克'
         ],
         ans: 4
      },
      {
         question: '下列何者是台灣第一位登上大聯盟的球員？',
         choices: [
          '陳金鋒',
          '王建民',
          '曹錦輝',
          '郭泓志'
         ],
         ans: 1
      },
      {
         question: '下列哪個城市「沒有」NBA球隊？',
         choices: [
          '奧克拉荷馬',
          '波士頓',
          '舊金山',
          '沙加緬度'
         ],
         ans: 3
      },
      {
         question: '現今台灣職業籃球聯盟SBL規則中，一隊最多能擁有多少洋將',
         choices: [
          '0',
          '1',
          '2',
          '3'
         ],
         ans: 3
      },
      {
         question: '以下哪所高中為2019年HBL冠軍球隊?',
         choices: [
          '能仁',
          '松山',
          '高苑',
          '南山'
         ],
         ans: 1
      },
      {
         question: '以下哪支球隊為2019年SBL聯盟的冠軍球隊?',
         choices: [
          '台銀',
          '富邦',
          '台啤',
          '璞園'
         ],
         ans: 2
      },
      {
         question: '以下哪種行為在撞球裡「不算」犯規？',
         choices: [
          '打進白球',
          '色球未碰壁',
          '打進非目標色球',
          '貼著色球打白球'
         ],
         ans: 3
      },
      {
         question: '以下有關「慢速壘球」的規則，何者錯誤',
         choices: [
          '二好球後擊出界外球算三振',
          '觸身球不保送，僅以一壞球計',
          '跑者不得盜壘',
          '可以使用短打'
         ],
         ans: 4
      },
      {
         question: '足球運動中，會對攻擊方向前傳接球時接球者允許的位置做出限制的規則，稱為？',
         choices: [
          '越線',
          '走步',
          '越位',
          '越界'
         ],
         ans: 3
      },
      {
         question: 'KJ最喜歡的NBA球星是賽爾提克隊背號11號的Kyrie Irving，請問下列哪位球星也穿過背號11號',
         choices: [
          'Kobe Bryant',
          'Jeremy Lin',
          'Ming Yao',
          'Stephen Curry'
         ],
         ans: 3
      },
      {
         question: '日本職棒分為哪兩聯盟？',
         choices: [
          '國家聯盟和美國聯盟',
          '中央聯盟和太平洋聯盟',
          '東區聯盟和西區聯盟',
          '夢幻聯盟和魔法聯盟'
         ],
         ans: 2
      },
      {
         question: 'NBA下列哪一個號碼沒有人穿過或是不存在？',
         choices: [
          '0',
          '38',
          '00',
          '69'
         ],
         ans: 4
      },
      {
         question: '請問「John Cena」拿過幾次WWE冠軍',
         choices: [
          '7',
          '10',
          '13',
          '16'
         ],
         ans: 3
      },
      {
         question: '請問排球中的副攻手又被稱為什麼？',
         choices: [
          '二傳手',
          '攔中',
          '舉對',
          '自由球員'
         ],
         ans: 2
      },
      {
         question: '請問健康體能333「不包含」下列何者',
         choices: [
          '每週運動3天',
          '每分鐘呼吸30次',
          '每次30分鐘',
          '每分鐘心跳達到130下'
         ],
         ans: 2
      },
      {
         question: '躲避球在台灣有全國賽，贏的國小可以得到什麼旗插在校內一年',
         choices: [
          '龍鳳旗',
          '嘉文戰旗',
          '猛虎旗',
          '五環旗'
         ],
         ans: 1
      },
      {
         question: '請問中華職業棒球大聯盟的四支創始球隊「不包含」下列何者',
         choices: [
          '味全龍',
          '三商虎',
          '興農牛',
          '兄弟象'
         ],
         ans: 3
      },
      {
         question: '請問台灣之光「王建民」擅長的球路為何？',
         choices: [
          '蝴蝶球',
          '大曲球',
          '卡特球',
          '伸卡球'
         ],
         ans: 4
      },
      {
         question: '請問「沙灘排球」比賽中一方有幾位球員',
         choices: [
          '2',
          '3',
          '4',
          '6'
         ],
         ans: 1
      },
      {
         question: '請問台灣籃球的經典「俠獸對決」，指的是哪兩位球員的對戰',
         choices: [
          '陳信安/林志傑',
          '田壘/劉錚',
          '田壘/林志傑',
          '林志傑/劉錚'
         ],
         ans: 3
      },
      ],
      '織詩份子': [
      {
         question: '吉他的標準定弦中，音高由低到高分別為哪些',
         choices: [
          'DBEFAD',
          'DBEGBE',
          'EADFAD',
          'EADGBE'
         ],
         ans: 4
      },
      {
         question: '林俊傑-不為誰而做的歌「說不完喔？要不要寫成＿＿ 」底線為？',
         choices: [
          '一首歌',
          '表格',
          '小說',
          '故事'
         ],
         ans: 2
      },
      {
         question: '請問“鋼琴詩人”是指下列哪位鋼琴家？',
         choices: [
          '蕭邦',
          '李斯特',
          '莫札特',
          '貝多芬'
         ],
         ans: 1
      },
      {
         question: '請問「我邊寫繁體字，邊反體制」這句歌詞是出自誰的作品',
         choices: [
          '熊仔',
          'KyrieJ',
          '屁孩 Ryan',
          'PG One'
         ],
         ans: 2
      },
      {
         question: '請問2018年Spotify全球最高串流量歌手是下列何者？',
         choices: [
          'Ed Sheeran',
          'Ariana Grande',
          ' Drake',
          'Post Malone'
         ],
         ans: 3
      },
      {
         question: '請問2019年「葛萊梅獎」在那裡舉行頒獎典禮?',
         choices: [
          '洛杉磯',
          '紐約',
          '舊金山',
          '波士頓'
         ],
         ans: 1
      },
      {
         question: '請問反骨神曲-接業配的「將膽週年慶」沒有提到下列哪項好禮？',
         choices: [
          'PS4',
          'IPhoneX',
          'Switch',
          'IPad'
         ],
         ans: 4
      },
      {
         question: '請問鋼琴的黑鍵加白鍵一共有幾個鍵？',
         choices: [
          '87',
          '88',
          '67',
          '68'
         ],
         ans: 2
      },
      {
         question: '請問歌手「Aimer」因為聲帶受損而時用何種療法?',
         choices: [
          '冷凍療法',
          '沉默療法',
          '護嗓食療',
          '微創甲狀軟骨聲帶整型術'
         ],
         ans: 2
      },
      {
         question: '請問韓團TWICE中下列哪位不是韓國人?',
         choices: [
          '娜璉',
          '定延',
          'Sana',
          '多賢'
         ],
         ans: 3
      },
      {
         question: '請問吉他加烏克麗麗一共有多少條弦？',
         choices: [
          '9',
          '10',
          '11',
          '12'
         ],
         ans: 2
      },
      {
         question: '請問今年（2019年）是第幾屆金曲獎？',
         choices: [
          '28',
          '29',
          '30',
          '31'
         ],
         ans: 3
      },
      {
         question: '請問樂團ONE OK ROCK的鼓手是誰?',
         choices: [
          'Taka',
          'Toru',
          'Ryota',
          'Tomoya'
         ],
         ans: 4
      },
      {
         question: '請問米津玄師在以個人身分出道之前是用什麼名字在推出歌曲?',
         choices: [
          'hachi',
          'sasuke',
          'hanashi',
          'sina'
         ],
         ans: 1
      },
      {
         question: '請問目前youtube上點閱率第二高的音樂影片為何？',
         choices: [
          'See you again',
          'Shape of You',
          'Uptown Funk',
          'Gangnam Style'
         ],
         ans: 2
      },
      {
         question: '請問女歌手「9m88」沒有何哪位音樂人合作過',
         choices: [
          '蛋堡',
          'OZI',
          'Leo王',
          '屁孩Ryan'
         ],
         ans: 4
      },
      {
         question: '請問下列何者不是銅管樂器？',
         choices: [
          '薩克斯風',
          '小號',
          '法國號',
          '低音號'
         ],
         ans: 1
      },
      {
         question: '請問下列何者不是KPOP團體？',
         choices: [
          'EXO',
          'EXILE',
          'TWICE',
          'BTS'
         ],
         ans: 2
      },
      {
         question: '請問下列哪個歌手未入圍本次金曲獎？',
         choices: [
          'ozi',
          '蔡依林',
          '鄭宜農',
          '林俊傑'
         ],
         ans: 4
      },
      {
         question: '請問下列哪位歌手沒得過葛萊美獎',
         choices: [
          'Ed Sheeran',
          'Katy Perry',
          'Bruno Mars',
          'Adele'
         ],
         ans: 2
      },
      {
         question: '請問下列哪一句歌詞沒有出現在交大最知名的饒舌歌 <宰熊貓> 中',
         choices: [
          '講出這種話的智商，要是我早就投胎',
          '清大和頂大的距離是一條交清小徑',
          '不用強調自己有多努力',
          '被竹教併校那我想你們該重考'
         ],
         ans: 4
      },
      {
         question: '請問下列哪一首歌被收錄在饒舌歌手—蛋堡的專輯「收斂水」',
         choices: [
          '偷偷',
          '鄉愁',
          '我們都有問題',
          '過程'
         ],
         ans: 2
      },
      {
         question: '請問下列哪一首歌曲，沒有使用Sample(取樣)技巧',
         choices: [
          '史詩',
          '假朋友真兄弟',
          '飛行少女',
          '交大的驕傲'
         ],
         ans: 4
      },
      {
         question: '請問知名歌曲「千本櫻」，是由哪位虛擬歌手所演唱呢',
         choices: [
          '初音未來',
          '鏡音鈴',
          '鏡音連',
          'GUMI'
         ],
         ans: 1
      },
      {
         question: '請問知名歌曲「走到飛」是由幾名歌手一起合唱的？',
         choices: [
          '5',
          '6',
          '7',
          '8'
         ],
         ans: 3
      },
      {
         question: '請問周杰倫「給我一首歌的時間」有多長？',
         choices: [
          '3分14秒',
          '3分41秒',
          '4分13秒',
          '4分31秒'
         ],
         ans: 3
      },
      {
         question: '請問周杰倫一共出了多少歌曲?',
         choices: [
          '130',
          '107',
          '113',
          '152'
         ],
         ans: 4
      },
      {
         question: '下列何者不是古典時期的作曲家？',
         choices: [
          '海頓',
          '莫札特',
          '巴哈',
          '貝多芬'
         ],
         ans: 3
      },
      {
         question: '下列何者不是五人團體？',
         choices: [
          '五月天',
          '七月半',
          'Maroon 5',
          '飛輪海'
         ],
         ans: 4
      },
      {
         question: '下列哪一首歌最適合資工活動長',
         choices: [
          '成全',
          '給我一個理由忘記',
          '簡單愛',
          '都是'
         ],
         ans: 4
      },
      {
         question: '一個曲子的拍號是6 8 一個小節有六拍，以八分音符為一拍，請問一個小節可以塞幾個四分休止符？',
         choices: [
          '6 個',
          '3 個',
          '12 個',
          '2個'
         ],
         ans: 2
      },
      {
         question: '以下四首林俊傑的歌曲，何者和其他三首是不同專輯的歌',
         choices: [
          '她說',
          '當你',
          '愛笑的眼睛',
          '學不會'
         ],
         ans: 4
      },
      {
         question: '以下四首林俊傑的官方MV，何者長度最長？',
         choices: [
          '黑夜問白天',
          '關鍵詞',
          '江南',
          '丹寧執著'
         ],
         ans: 1
      },
      {
         question: '在 玖壹壹-再會中港路 歌詞中「啦_______，我的中港路要再會啦」，空格中應填入？',
         choices: [
          '啦啦',
          '啦啦啦',
          '啦啦啦啦',
          '啦啦啦啦啦'
         ],
         ans: 3
      },
      {
         question: '作品「胡桃鉗」的作曲家為？',
         choices: [
          '舒伯特',
          '巴哈',
          '柴可夫斯基',
          '貝多芬'
         ],
         ans: 3
      },
      {
         question: 'Cm和弦的組成音為何',
         choices: [
          'C bE G',
          'C F bA',
          'C E #G',
          'C #D E'
         ],
         ans: 1
      },
      {
         question: '火燒的寂寞是什麼調的',
         choices: [
          'CM',
          'Cm',
          'AM',
          'Am'
         ],
         ans: 2
      },
      {
         question: '大調音階的全半音組成為',
         choices: [
          '全全半全全全半',
          '全全半半全全半',
          '半半全全半半全',
          '全半全全半全全'
         ],
         ans: 1
      },
      {
         question: '下列何者為完全音階',
         choices: [
          '三度音階',
          '五度音階',
          '七度音階',
          '九度音階'
         ],
         ans: 2
      },
      {
         question: '請問「EDM」曲風中的「D」指的是什麼意思',
         choices: [
          'Digital',
          'Dance',
          'Diamond',
          'Debounce'
         ],
         ans: 2
      },
      ],
      '滯視份子': [
      {
         question: '「 是我，是我先，明明都是我先來的。」 請問這句經典動漫台詞出自下列哪部作品',
         choices: [
          'NO GAME NO LIFE 遊戲人生',
          '白色相簿2',
          '乒乓',
          '五等分的花嫁'
         ],
         ans: 2
      },
      {
         question: '電影「美國隊長3：英雄內戰」中，何者在內戰中從頭到尾皆屬鋼鐵人陣營',
         choices: [
          '蜘蛛人',
          '黑寡婦',
          '獵鷹',
          '緋紅女巫'
         ],
         ans: 1
      },
      {
         question: '電影哈利波特中，主角哈利的魔杖是由什麼材質做成',
         choices: [
          '冬青木',
          '鳳凰木',
          '接骨木',
          '紫杉木'
         ],
         ans: 1
      },
      {
         question: '哈利波特電影中，下列何者「不曾」被佛地魔拿來當成分靈體?',
         choices: [
          '湯姆瑞斗的日記',
          '雷文克勞的王冕',
          '葛來分多的寶劍',
          '娜吉尼'
         ],
         ans: 3
      },
      {
         question: '近年來很多Youtuber都急速竄紅，請問下列台灣Youtuber誰「最南部」',
         choices: [
          '蔡哥',
          'HowHow',
          '孫生',
          '放火'
         ],
         ans: 1
      },
      {
         question: '每年由週刊女性PRIME進行統計的「喜歡的傑尼斯藝人」排行，2019年第一名是誰？',
         choices: [
          '二宮和也',
          '山田涼介',
          '山下智久',
          '龜梨和也'
         ],
         ans: 2
      },
      {
         question: '請問「黑子的籃球」中的赤司擁有什麼眼睛？',
         choices: [
          '撒旦之眼',
          '天帝之眼',
          '血輪眼',
          '霸王之眼'
         ],
         ans: 2
      },
      {
         question: '請問「進擊的巨人」中的阿爾敏的姓氏為何？',
         choices: [
          '亞魯雷特',
          '薩克雷',
          '夏迪斯',
          '布朗'
         ],
         ans: 1
      },
      {
         question: '請問「決鬥社」一詞，最早在哈利波特第幾集中出現',
         choices: [
          '1',
          '2',
          '3',
          '4'
         ],
         ans: 2
      },
      {
         question: '請問「秒速五釐米」的男主角，曾經因為父母工作的關係，搬家到日本的何處？',
         choices: [
          '鹿耳島',
          '長崎',
          '北海道',
          '大阪'
         ],
         ans: 1
      },
      {
         question: '請問「你的名字」主題曲「前前前世」是下列哪個樂團的作品？',
         choices: [
          'My Hair Is Bad',
          'Lucky Tapes',
          'RADWIMPS',
          'B\'z'
         ],
         ans: 3
      },
      {
         question: '請問「七龍珠」中的西魯有幾種型態？',
         choices: [
          '2',
          '3',
          '4',
          '5'
         ],
         ans: 2
      },
      {
         question: '請問「棋靈王」中，哪個人「沒有」在網路上跟sai對弈過',
         choices: [
          '和谷義高',
          '塔矢行洋',
          '塔矢亮',
          '緒方精次'
         ],
         ans: 4
      },
      {
         question: '請問「棋靈王」中，佐為被誣陷之後是怎樣死去的？',
         choices: [
          '心臟病發',
          '抑鬱而終',
          '飲毒自殺',
          '投河自盡'
         ],
         ans: 4
      },
      {
         question: '請問唱「PPAP」的人叫什麼名字？',
         choices: [
          'Piko一郎',
          'Pocky太郎',
          'Piko太郎',
          'Piko蟑螂'
         ],
         ans: 3
      },
      {
         question: '請問電影「明天，我要和昨天的妳約會」中，女主角是由下列何者飾演？',
         choices: [
          '橋本環奈',
          '吉岡里帆',
          '新垣結衣',
          '小松菜奈'
         ],
         ans: 4
      },
      {
         question: '請問電影「唐伯虎點秋香」中，華安是住在哪裡？',
         choices: [
          '蘇州',
          '長安',
          '北京',
          '四川'
         ],
         ans: 1
      },
      {
         question: '請問動漫「我的英雄學院」中，主角為能力ONE FOR ALL繼承的第幾代?',
         choices: [
          '6',
          '7',
          '8',
          '9'
         ],
         ans: 4
      },
      {
         question: '請問多拉A夢中的小夫，日文姓氏為何',
         choices: [
          '川牛木',
          '長谷川',
          '谷關',
          '骨川'
         ],
         ans: 4
      },
      {
         question: '請問多拉A夢最新的電影版為下列何者',
         choices: [
          'Stand by me',
          '大雄的金銀島',
          '大雄的月球探測記',
          '大雄的南極冰天雪地大冒險'
         ],
         ans: 3
      },
      {
         question: '請問海綿寶寶的鄰居章魚哥，有幾隻觸角呢',
         choices: [
          '5',
          '6',
          '7',
          '8'
         ],
         ans: 2
      },
      {
         question: '請問海賊王中，下列何者的懸賞金最高',
         choices: [
          '卡塔庫慄',
          '薩波',
          '索隆',
          '艾斯'
         ],
         ans: 1
      },
      {
         question: '請問海賊王中，在蛋糕島篇被魯夫擊敗的克力架（餅乾果實能力者）是Big Mom的第幾個兒子？',
         choices: [
          '10',
          '17',
          '23',
          '25'
         ],
         ans: 1
      },
      {
         question: '請問何者非知名網紅團體「wackyboy」的口頭禪？',
         choices: [
          '說到做到！',
          '地！',
          '失敗！',
          '應到未到！'
         ],
         ans: 3
      },
      {
         question: '請問何者名偵探柯南劇場版的上映時間是最早的？',
         choices: [
          '往天國的倒數計時',
          '第十四號獵物',
          '引爆摩天樓',
          '世紀末的魔術師'
         ],
         ans: 3
      },
      {
         question: '請問黃色是嵐ARASHI中誰的代表色？',
         choices: [
          '大野智 ',
          '櫻井翔',
          '二宮和也 ',
          '松本潤 '
         ],
         ans: 3
      },
      {
         question: '請問火影忍者中，「五尾」的本名是什麼',
         choices: [
          '又旅',
          '磯撫',
          '穆王',
          '重明'
         ],
         ans: 3
      },
      {
         question: '請問火影忍者中，誰「不曾」是斬首大刀的持有者',
         choices: [
          '桃地再不斬',
          '枇杷十藏',
          '鬼燈滿月',
          '鬼燈水月'
         ],
         ans: 3
      },
      {
         question: '請問火影忍者中，體術「八門遁甲」第六門為何',
         choices: [
          '傷門',
          '休門',
          '驚門',
          '景門'
         ],
         ans: 4
      },
      {
         question: '請問漫威漫畫中，復仇者們利用時間寶石到未來發現世界被誰統治了？',
         choices: [
          '奧創',
          '薩諾斯',
          '九頭蛇',
          '多瑪暮'
         ],
         ans: 1
      },
      {
         question: '請問美國隊長的盾牌由以下哪種材質製成',
         choices: [
          '亞德曼金屬',
          '汎金屬',
          '鉑',
          '鉛'
         ],
         ans: 2
      },
      {
         question: '請問木曜四超玩的一日系列，目前播出至第幾集',
         choices: [
          '52',
          '68',
          '99',
          '100'
         ],
         ans: 4
      },
      {
         question: '請問日劇「UNNATURAL」的主題曲是下面哪一首歌?',
         choices: [
          'pretender',
          'wonderland',
          'pray',
          'lemon'
         ],
         ans: 4
      },
      {
         question: '請問視網膜在華視的節目名稱為何？',
         choices: [
          '網膜夜夜秀',
          '視網膜玻璃',
          '今夜造口夜',
          '天天造口夜'
         ],
         ans: 3
      },
      {
         question: '請問台灣史上第一部偶像劇為何',
         choices: [
          '百分百女孩',
          '紫禁之巔',
          '惡魔在身邊',
          '流星花園'
         ],
         ans: 4
      },
      {
         question: '請問下列電影中哪一個「沒有」用到時空旅行的概念',
         choices: [
          '復仇者聯盟',
          '魔鬼終結者',
          '回到未來',
          '戰爭遊戲'
         ],
         ans: 4
      },
      {
         question: '請問下列何者不是「Fred吃上癮」頻道的三寶之一',
         choices: [
          'Peter',
          '牛排',
          '天分',
          '松露'
         ],
         ans: 2
      },
      {
         question: '請問下列何者不是Disney旗下的公司?',
         choices: [
          '國家地理頻道',
          '二十世紀福斯',
          'ESPN',
          '夢工廠'
         ],
         ans: 4
      },
      {
         question: '請問下列何者非節目「中國新說唱」出現過的人？',
         choices: [
          '李榮浩',
          '周興哲',
          '吳亦凡',
          '王以太'
         ],
         ans: 2
      },
      {
         question: '請問小說「解憂雜貨店」是由哪位日本作家所著？',
         choices: [
          '東野圭吾',
          '太宰治',
          '宮澤賢治',
          '夏目漱石'
         ],
         ans: 1
      },
      {
         question: '請問在「獵人」中，哪一位是三星獵人呢',
         choices: [
          '帕里斯通',
          '金．富力士',
          '奇犽．揍敵客',
          '凱特'
         ],
         ans: 1
      },
      {
         question: '請問在「獵人」中，請問何者「非」6大念的系統？',
         choices: [
          '強化系',
          '操作系',
          '放射系',
          '具現化系'
         ],
         ans: 3
      },
      {
         question: '下列何者「不是」麥卡貝網路電視製作的節目',
         choices: [
          '現在宅知道',
          '木曜4超玩',
          '拜五趴厚系',
          '誰來晚餐'
         ],
         ans: 4
      },
      {
         question: '下列漫畫何者連載時間最長？',
         choices: [
          '蠟筆小新',
          '烏龍派出所',
          '櫻桃小丸子',
          '哆啦A夢'
         ],
         ans: 2
      },
      {
         question: '下列哪位饒舌歌手並「無」參加過中國有嘻哈節目？',
         choices: [
          'BCW',
          'PG one',
          '熊仔',
          'Jony J'
         ],
         ans: 3
      },
      {
         question: '知名八點檔「風水世家」總共有多少集數',
         choices: [
          '721',
          '162',
          '871',
          '426'
         ],
         ans: 4
      },
      {
         question: '知名動漫「神奇寶貝」中，主角皮卡丘的招式「十萬伏特」無法對下列何者造成傷害',
         choices: [
          '三地鼠',
          '鋼鐵鳥',
          '拉達',
          '瑪瑙水母'
         ],
         ans: 1
      },
      {
         question: '知名動漫「一拳超人」中，何者不屬於S級英雄',
         choices: [
          '傑諾斯',
          '殭屍男',
          '甜心假面',
          '龍捲'
         ],
         ans: 3
      },
      {
         question: '知名動漫「一拳超人」中，秒殺原子武士的是下列哪個怪人協會幹部？',
         choices: [
          '黑色精子',
          '天然水',
          '波奇',
          '大炯眼'
         ],
         ans: 1
      },
      {
         question: '知名美劇「冰與火之歌」中飾演龍女的艾蜜莉·克拉克‬還演出過下列哪一部電影？',
         choices: [
          '我就要你好好的',
          '龐貝',
          '黑豹',
          'X戰警'
         ],
         ans: 1
      },
      ],
      '識字份子': [
      {
         question: '「丼」怎麼念？',
         choices: [
          'ㄉㄨㄥˋ',
          'ㄐㄧㄡˇ',
          'ㄉㄨㄥˇ',
          'ㄐㄧㄥˇ'
         ],
         ans: 4
      },
      {
         question: '「夔」字的讀音同',
         choices: [
          '奎',
          '謝',
          '滅',
          '竊'
         ],
         ans: 1
      },
      {
         question: '「無他 惟手熟爾」出現在下列哪篇文章中',
         choices: [
          '醉翁亭記',
          '始得西山宴遊記',
          '諫逐客書',
          '賣油翁'
         ],
         ans: 4
      },
      {
         question: '秉寬今天喝太多Red Bull，以至於一直跑廁所，請問下列選項哪個不是去尿尿的意思',
         choices: [
          'take a dump',
          'take a piss',
          'take a leak',
          'answer the call of nature'
         ],
         ans: 1
      },
      {
         question: '曾經滄海難為水，除去____不是雲',
         choices: [
          '黃山',
          '虎山',
          '巫山',
          '衣衫'
         ],
         ans: 3
      },
      {
         question: '請問「低頭族」英文怎麼說',
         choices: [
          'Low head family',
          'phubber',
          'selfie',
          'facepalm'
         ],
         ans: 2
      },
      {
         question: '請問「滅絕師太」出現在金庸哪個小說?',
         choices: [
          '天龍八部',
          '鹿鼎記',
          '倚天屠龍記',
          '射鵰英雄傳'
         ],
         ans: 3
      },
      {
         question: '請問「事」屬於六書中的?',
         choices: [
          '象形',
          '指事',
          '會意',
          '形聲'
         ],
         ans: 4
      },
      {
         question: '請問「停車__ __楓林晚」該填入哪個詞？',
         choices: [
          '做愛',
          '坐愛',
          '座愛',
          '硬啦'
         ],
         ans: 2
      },
      {
         question: '請問「我看歪腰郵筒」是哪一年學測國文長文的題目',
         choices: [
          '104學測',
          '105學測',
          '106學測',
          '107學測'
         ],
         ans: 2
      },
      {
         question: '請問「徐霞客遊記」是由下列何者所撰寫',
         choices: [
          '徐宏祖',
          '徐志摩',
          '徐光啟',
          '徐佳瑩'
         ],
         ans: 1
      },
      {
         question: '請問「資」屬於六書中的?',
         choices: [
          '象形',
          '指事',
          '會意',
          '形聲'
         ],
         ans: 4
      },
      {
         question: '請問「醉翁亭記」的作者是誰',
         choices: [
          '孟浩然',
          '歐陽修',
          '陸游',
          '王安石'
         ],
         ans: 2
      },
      {
         question: '請問「bear」沒有下列哪個意思？',
         choices: [
          '熊',
          '攜帶',
          '後面',
          '忍受'
         ],
         ans: 3
      },
      {
         question: '請問畢業門檻國文要修幾學分',
         choices: [
          '2',
          '4',
          '6',
          '0'
         ],
         ans: 4
      },
      {
         question: '請問國字二十的「廿」讀音為何？',
         choices: [
          'ㄍㄢˉ',
          'ㄦˋㄕˊ',
          'ㄋㄧㄢˋ',
          'ㄨㄢˋ'
         ],
         ans: 3
      },
      {
         question: '請問經典課文《雅量》中，大家對於同一件衣料有不同看法，請問該衣料顏色為何 ?',
         choices: [
          '綠色',
          '黃色',
          '紅色',
          '藍色'
         ],
         ans: 1
      },
      {
         question: '請問木蘭詩中「東市買駿馬，西市買____ 」，____ 中應該填入？',
         choices: [
          '鞍韉',
          '轡頭',
          '長鞭',
          '長矛'
         ],
         ans: 1
      },
      {
         question: '請問宋詞《蝶戀花》中「庭院深深深幾許」下一句接甚麼',
         choices: [
          '深字不相鄰請問有幾種排法',
          '楊柳堆煙',
          '簾卷西風，人比黃花瘦',
          '為伊消得人憔悴'
         ],
         ans: 2
      },
      {
         question: '請問下列何者「不是」唐宋古文八大家的一員',
         choices: [
          '韓愈',
          '王安石',
          '韓冰',
          '歐陽修'
         ],
         ans: 3
      },
      {
         question: '請問下列哪個「不是」十三經中的春秋三傳',
         choices: [
          '左傳',
          '公羊傳',
          '榖梁傳',
          '毓梁傳'
         ],
         ans: 4
      },
      {
         question: '請問下列注音何者正確？',
         choices: [
          '「斡」旋 ：ㄍㄢˋ',
          '紀皓「晢」：ㄒㄧ',
          '「法」式：ㄈㄚˋ',
          '「蓼」莪：ㄌㄨˋ'
         ],
         ans: 4
      },
      {
         question: '請問英語俗諺「He who has health has hope.」是什麼意思',
         choices: [
          '留得青山在，不怕沒柴燒',
          '禍不單行',
          '三思而後行',
          '健康很重要'
         ],
         ans: 1
      },
      {
         question: '請問在「背影」一文中，朱自清與父親別離後已經幾年沒相見？',
         choices: [
          '1年',
          '2年',
          '3年',
          '4年'
         ],
         ans: 2
      },
      {
         question: '請問在英文中「dog days」的意思是?',
         choices: [
          '美好的一天',
          '狗狗節',
          '最熱的一天',
          '鳥日子'
         ],
         ans: 3
      },
      {
         question: '日文中，「薬指」是指下列哪一根手指頭？',
         choices: [
          '拇指',
          '食指',
          '中指',
          '無名指'
         ],
         ans: 4
      },
      {
         question: '日文中，「お尻」是下列哪一個意思？',
         choices: [
          '屁股',
          '肛門',
          '尾椎',
          '盲腸'
         ],
         ans: 1
      },
      {
         question: '日文中，「怪我」指的是?',
         choices: [
          '自責',
          '責怪',
          '受傷',
          '生病'
         ],
         ans: 3
      },
      {
         question: '日文中的「米国」是指下列哪一個國家？',
         choices: [
          '英國',
          '台灣',
          '美國',
          '加拿大'
         ],
         ans: 3
      },
      {
         question: '唐代詩人孟浩然 字什麼?',
         choices: [
          '浩然',
          '退之',
          '介甫',
          '永叔'
         ],
         ans: 1
      },
      {
         question: '下列何者不是狗的品種？',
         choices: [
          'Beagle',
          'Pug',
          'Poodle',
          'Pusheen'
         ],
         ans: 4
      },
      {
         question: '下列哪一句話意義與其他三句不同?',
         choices: [
          '中華隊大敗於日本隊',
          '中華隊大敗日本隊',
          '中華隊大勝日本隊',
          '中華隊勝日本隊'
         ],
         ans: 1
      },
      {
         question: '下列戲曲作品與作者配對，何者「錯誤」?',
         choices: [
          '《竇娥冤》- 關漢卿',
          '《西廂記》- 王實甫',
          '《琵琶記》- 元稹',
          '《牡丹亭》- 湯顯祖'
         ],
         ans: 3
      },
      {
         question: '下列新出現的英文單字何者翻譯正確',
         choices: [
          'beer o’clock 九點',
          'bromance  男男同性戀',
          'awesomesauce 神奇的調味料',
          'hangry 餓到生氣'
         ],
         ans: 4
      },
      {
         question: '下列英文單字的複數變化何者「錯誤」?',
         choices: [
          'echo -> echoes',
          'piano -> pianos',
          'ox -> oxes',
          'deer -> deer'
         ],
         ans: 3
      },
      {
         question: '一府二鹿三艋舺的「艋」有幾劃',
         choices: [
          '18',
          '16',
          '14',
          '12'
         ],
         ans: 3
      },
      {
         question: '英文字母，倒數第12個英文字中是什麼',
         choices: [
          'Ｍ',
          'Ｎ',
          'Ｏ',
          'Ｐ'
         ],
         ans: 3
      },
      {
         question: '知名啤酒企業「Asahi」的漢字是？',
         choices: [
          '朝月',
          '朝日',
          '朝田',
          '朝火'
         ],
         ans: 2
      },
      {
         question: '資工系上有很多同學酒醉後容易失態，請問英文中會用哪一種動物來形容酒醉呢',
         choices: [
          'as drunk as a horse',
          'as drunk as a skunk',
          'as drunk as a bird',
          'as drunk as a beaver'
         ],
         ans: 2
      },
      {
         question: '總務芳瑀被稱為「資工鐵公雞」，請問鐵公雞一詞除了小氣之外，還有下列哪個意思呢',
         choices: [
          '大打出手',
          '脾氣古怪',
          '虛張聲勢',
          '臭臉待人'
         ],
         ans: 1
      },
      {
         question: 'NBA暴龍隊的林書豪常常坐「冷板凳」，請問「冷板凳」在古代，是指誰的座位',
         choices: [
          '政府官員',
          '老師',
          '歌女',
          '皇帝的後宮們'
         ],
         ans: 2
      },
      {
         question: 'How do you do?',
         choices: [
          'I\'m a student.',
          'How do you do?',
          'I\'m fine.',
          'Dow di zai gan ma'
         ],
         ans: 2
      },
      {
         question: '請問「小時後爸媽都交待我不能再汗流夾背時，直接近冷氣房」中有幾個錯字',
         choices: [
          '3',
          '4',
          '5',
          '6'
         ],
         ans: 3
      },
      ],
      '資事份子': [
      {
         question: '柏憲在教同學寫「BFS」演算法，請問他最可能先介紹哪個資料結構？',
         choices: [
          'Red Black Tree',
          'Queue',
          'Hash Table',
          'Disjoint Sets'
         ],
         ans: 2
      },
      {
         question: '編譯器架構中分為前端和後端，請問下列哪一項「不屬於」前端',
         choices: [
          'Lexical Analyzer',
          'Syntax Analyzer',
          'Code Optimizer',
          'Semantic Analyzer'
         ],
         ans: 3
      },
      {
         question: '積體電路上可容納的電晶體數目，約每隔兩年便會增加一倍，請問這是什麼定律',
         choices: [
          '摩爾定律',
          '莫非定律',
          '晶體翻倍定律',
          '電晶定律'
         ],
         ans: 1
      },
      {
         question: '假設在河內塔中總共有4個圓盤，要把這4個圓盤從A塔移動到C塔，最少要多少次移動',
         choices: [
          '17次',
          '16次',
          '15次',
          '14次'
         ],
         ans: 3
      },
      {
         question: '今天吉米想下載一個C的編譯器，請問他應該找甚麼呢?',
         choices: [
          'DEV C++',
          'Visual Stdio Code',
          'GCC',
          'Vim'
         ],
         ans: 3
      },
      {
         question: '俊傑今天登入交大資工工作站，想要修改自己的密碼，請問他需要使用哪個指令',
         choices: [
          'chmod',
          'passwd',
          'tmux',
          'pwd'
         ],
         ans: 2
      },
      {
         question: '請問「MCSL」是下列哪一堂課程名稱的英文縮寫',
         choices: [
          '數位電路實驗',
          '後量子密碼學',
          '作業系統設計與實作',
          '微處理機系統實驗'
         ],
         ans: 4
      },
      {
         question: '請問2019年交大資工之夜的名稱是',
         choices: [
          '知識份子',
          '姿勢份子',
          '直尺份子',
          '資事份子'
         ],
         ans: 4
      },
      {
         question: '請問從工三大廳正門面向電梯的方向，哪一台電梯可以直達7樓',
         choices: [
          '左邊的',
          '右邊的',
          '兩台都可以',
          '兩台都不行'
         ],
         ans: 2
      },
      {
         question: '請問工三哪一間教室內，額外有一扇可以通往工三外面的門',
         choices: [
          'EC122',
          'EC115',
          'EC114',
          'EC116'
         ],
         ans: 2
      },
      {
         question: '請問交大資工「系露營」連續幾年辦在神農科技休閒農場？',
         choices: [
          '1',
          '2',
          '3',
          '4'
         ],
         ans: 3
      },
      {
         question: '請問交大資工「系主任」的任期是多久',
         choices: [
          '3年',
          '4年',
          '5年',
          '6年'
         ],
         ans: 1
      },
      {
         question: '請問交大資工系辦常駐幾個行政人員',
         choices: [
          '9',
          '10',
          '11',
          '12'
         ],
         ans: 3
      },
      {
         question: '請問交大資工之夜 - 資事份子的前導ARG中，要到哪一家飲料店買「紅汁」',
         choices: [
          'Coco',
          '米克Q',
          '一芳',
          'COMEBUY'
         ],
         ans: 2
      },
      {
         question: '請問交大資工自108學年度入學開始分成幾組',
         choices: [
          '1',
          '2',
          '3',
          '4'
         ],
         ans: 2
      },
      {
         question: '請問網站 MVC 架構中的 M 代表哪個單字',
         choices: [
          'Modern',
          'Mock',
          'Model',
          'Module'
         ],
         ans: 3
      },
      {
         question: '請問下列何者「不是」構成網頁前端的三大元素之一？',
         choices: [
          'PHP',
          'HTML',
          'CSS',
          'JavaScript'
         ],
         ans: 1
      },
      {
         question: '請問下列何者是電路中的「儲存裝置」之一',
         choices: [
          'Flip-Flop',
          'Decoder',
          'Multiplexer',
          'Full Adder'
         ],
         ans: 1
      },
      {
         question: '請問下列何者職稱「不是」教授',
         choices: [
          '單智君',
          '陳永昇',
          '張明峰',
          '易志偉'
         ],
         ans: 1
      },
      {
         question: '請問下列進位制數字，哪一個和其他三者大小不同？',
         choices: [
          '11011 (2進制)',
          '31 (8進制)',
          '25 (10進制)',
          '19 (16進制)'
         ],
         ans: 1
      },
      {
         question: '請問下列哪個不是09級網多組中「多媒體」的三個必修？',
         choices: [
          '數值方法',
          '電腦動畫與特效',
          '計算機圖學概論',
          '影像處理概論'
         ],
         ans: 2
      },
      {
         question: '請問下列哪個不是用來求取「Maximum s-t Flow」的演算法',
         choices: [
          'Ford-Fulkerson Algorithm',
          'Edmonds-Karp Algorithm',
          'Dinic\'s Algorithm',
          'Kruskal\'s Algorithm'
         ],
         ans: 4
      },
      {
         question: '請問下列哪個名稱「不是」交大資訊工程學系的前身',
         choices: [
          '自動控制學系',
          '計算機科學系',
          '計算機工程學系',
          '控制工程學系'
         ],
         ans: 1
      },
      {
         question: '請問已經結束的CPE考試中，離今天最近的是在哪一天？',
         choices: [
          '2019/05/13 (一)',
          '2019/05/15 (三)',
          '2019/05/20 (一)',
          '2019/05/22 (三)'
         ],
         ans: 2
      },
      {
         question: '請問以下關於「Loop Unrolling」的敘述何者正確',
         choices: [
          '增加程式碼可讀性',
          '可能增益程式執行效能',
          '有效減少程式碼長度',
          '降低程式平行執行的機會'
         ],
         ans: 2
      },
      {
         question: '請問以下哪位不是「所長」',
         choices: [
          '胡毓志',
          '彭文志',
          '曹孝櫟',
          '曾新穆'
         ],
         ans: 1
      },
      {
         question: '請問在「我們與資夜的距離」影片中，女二與資夜的距離約為多少',
         choices: [
          '320公尺',
          '420公尺',
          '520公尺',
          '620公尺'
         ],
         ans: 3
      },
      {
         question: '請問在今年北資盃的哪一個項目，交大資工沒有拿冠軍',
         choices: [
          '女排',
          '男籃',
          '女籃',
          '桌球'
         ],
         ans: 2
      },
      {
         question: '請問資工的驕傲羅文笙在梅竹賽的背號是幾號？',
         choices: [
          '17',
          '0',
          '69',
          '22'
         ],
         ans: 4
      },
      {
         question: '請問資工周活動脂嗜型玩家的「英雄聯盟」賽事中，梅竹英雄—黃彥凱用單手擊敗誰',
         choices: [
          '許晉瑋',
          '莊凱傑',
          '張軒瑞',
          '吳柏憲'
         ],
         ans: 4
      },
      {
         question: '請問C語言中printf的「f」有甚麼意義',
         choices: [
          '無意義',
          '避免函數名稱重複',
          '格式化字串',
          '正規化字串'
         ],
         ans: 3
      },
      {
         question: '請問LINUX的企鵝標誌名字為何',
         choices: [
          'Tux',
          'Max',
          'Cindy',
          'Sandy'
         ],
         ans: 1
      },
      {
         question: '下列 Linux command 哪個可以用來重新命名檔案 ',
         choices: [
          'cp',
          'rm',
          'mv',
          'grep'
         ],
         ans: 3
      },
      {
         question: '下列何者「不是」資工09系學會長參選人之一',
         choices: [
          '曹竣傑',
          '王柏盛',
          '莊凱傑',
          '黃政鈺'
         ],
         ans: 1
      },
      {
         question: '下列何者「不是」CPU的廠牌',
         choices: [
          'IBM',
          'AMD',
          'Intel',
          'IEM'
         ],
         ans: 4
      },
      {
         question: '下列何者是「macOS」中的套件管理工具？',
         choices: [
          'Homebrew',
          'pacman',
          'yum',
          'rpm'
         ],
         ans: 1
      },
      {
         question: '下列哪個程式語言「不是」直譯式語言',
         choices: [
          'JavaScript',
          'Python',
          'C',
          'Ruby'
         ],
         ans: 3
      },
      {
         question: '下列哪一位教授的辦公室樓層最高',
         choices: [
          '謝續平教授',
          '張立平教授',
          '曾煜棋教授',
          '蔡錫鈞教授'
         ],
         ans: 2
      },
      {
         question: '下列有關C語言變數命名規則中，何者錯誤？',
         choices: [
          '不能以數字開頭',
          '可以含有底線',
          '數字跟字母可以混用',
          '字母大小寫相同'
         ],
         ans: 4
      },
      {
         question: '小馬最近想找專題指導教授，請問她整理的教授與研究領域配對中，何者最可能有誤？',
         choices: [
          '林文杰 - 軟體定義網路',
          '吳毅成 - 電腦遊戲AI',
          '趙禧綠 - 無線通訊網路',
          '張永儒 - 人機互動'
         ],
         ans: 1
      },
      {
         question: '小明的電腦跑起來很慢，請問他應該更換下列何者，較有機會改善電腦效能',
         choices: [
          '滑鼠',
          '鍵盤',
          '螢幕',
          '記憶體'
         ],
         ans: 4
      },
      {
         question: '小明上禮拜三去考了CPE，很幸運的壓線通過，請問他考了幾分？',
         choices: [
          '2',
          '2.4',
          '2.8',
          '3'
         ],
         ans: 2
      },
      {
         question: '筱惠練習CPE題目時，在系統送出程式碼後收到「CE」，請問代表什麼意思',
         choices: [
          '超過時間限制',
          '執行時錯誤',
          '編譯時錯誤',
          '超過記憶體限制'
         ],
         ans: 3
      },
      {
         question: '信耀的妹妹看到他放在桌上的作業寫著「DFA與NFA轉換」，請問最可能是哪一科作業',
         choices: [
          '線性代數',
          '正規語言概論',
          '密碼學概論',
          '組合數學'
         ],
         ans: 2
      },
      {
         question: '一般程式在記憶體分為好幾個區段，其中程式指令會放在以下哪個區段？',
         choices: [
          'Text Section',
          'Data Section',
          'Heap Section',
          'Stack Section'
         ],
         ans: 1
      },
      {
         question: '宥宥不會寫演算法作業「求圖上單源最短路徑」，請問他最有可能google哪個關鍵字',
         choices: [
          'Alpha-Beta Search',
          'Union-Find',
          'Binary Search',
          'Dijkstra'
         ],
         ans: 4
      },
      {
         question: '在建立TCP連線時，需進行 N-way handshaking，請問N為何',
         choices: [
          '1',
          '2',
          '3',
          '4'
         ],
         ans: 3
      },
      {
         question: '在使用git的時候，如果有commit後悔了想要刪除，可以使用下列哪個git指令',
         choices: [
          'git return',
          'git rm',
          'git reset',
          'git back'
         ],
         ans: 3
      },
      {
         question: '在python3.7的環境執行下，有一個變數arr = [100, 200, 300]，下列何者取值會有錯誤',
         choices: [
          'arr[0]',
          'arr[1]',
          'arr[-1]',
          'arr[3]'
         ],
         ans: 4
      },
      {
         question: 'Linux系統主要的設定檔，如帳號密碼檔、 各種服務的啟始檔等，通常放在哪個目錄下',
         choices: [
          '/etc',
          '/mnt',
          '/dev',
          '/bin'
         ],
         ans: 1
      }
      ]}

export { QUI, data }
