
let QUI = {
  level: null,
  qno: 0,
  length: 1, // 每個向度要出幾題
  random: [], // 隨機生成的題號
  score: [120, 162, 226, 292, 360, 420, 500, 600, 600], // 對應秒數答對時獲得的分數
  bonus: [1, 1.25, 1.5, 1.75, 2, 2.5, 3, 3.5, 3.5, 4], // 連續答對時倍率
  maxScore: 24 * 600
}

const section = {
  '白爛題': 1,
  '電玩知識題': 2,
  '交大校園題': 3,
  '社會題': 4,
  '時事題': 5,
  '體育題': 6,
  '音樂題': 7,
  '動漫影視題': 8,
  '語文題': 9,
  '資工知識題': 10
}

// 每個attribute對應到一個關卡(共10個)
const data = {
  '白爛題': [
    {
       question: '巴士上有3個女生，每個女生都有3個背包，每個背包有3隻貓，請問巴士上有多少隻腳？(人腳+貓腳、不含司機)',
       choices: [
        '96',
        '120',
        '108',
        '114'
       ],
       ans: 4
    },
    {
       question: '大雄今天有60元，一杯飲料30元，今天大雄拿著60元請胖虎買飲料，請問他可以拿到幾杯',
       choices: [
        '0',
        '1',
        '2',
        '3'
       ],
       ans: 1
    },
    {
       question: '請問 「欸～你是誰？」是誰的口頭禪',
       choices: [
        '趟延思',
        '趙廷思',
        '趙廷恩',
        '趙延恩'
       ],
       ans: 3
    },
    {
       question: '請問Mac系列筆電從哪一年開始蘋果LOGO燈不再發亮',
       choices: [
        '2014',
        '2015',
        '2016',
        '2017'
       ],
       ans: 3
    },
    {
       question: '下列誰曾經的學業成績排名百分比最高',
       choices: [
        '陳亭妤',
        '魏晧國',
        '黃政鈺',
        '黃祖寬'
       ],
       ans: 3
    },
    {
       question: '下雨天了怎麼辦',
       choices: [
        '撐傘',
        '淋雨',
        '我好想你',
        '漫步宇宙'
       ],
       ans: 3
    },
    {
       question: 'Google首頁的字母O分別是甚麼顏色',
       choices: [
        '紅色/黃色',
        '黃色/藍色',
        '藍色/綠色',
        '綠色/紅色'
       ],
       ans: 1
    },
    {
       question: '請問09資工系學會會長在他應屆的學測國文作文長文部分拿了幾分',
       choices: [
        '8',
        '12',
        '16',
        '23'
       ],
       ans: 1
    },
    {
       question: '期中考時有很多同學中途跑去上廁所，但廁所裡都沒聽到沖水的聲音，請問最有可能是哪個原因',
       choices: [
        '那間廁所沖水沒聲音',
        '褲子穿反到廁所換',
        '教室太熱拿廁所紙巾擦汗',
        '偷用手機查解答'
       ],
       ans: 4
    },
    {
       question: '請問google小恐龍，背上有幾支刺',
       choices: [
        '0',
        '1',
        '2',
        '3'
       ],
       ans: 1
    },
    {
       question: '彩虹的第八個顏色是什麼',
       choices: [
        '黑色',
        '粉紅色',
        '深綠色',
        '白色'
       ],
       ans: 1
    },
    {
       question: '我難過的是',
       choices: [
        '放棄你放棄愛',
        '把一個人的溫暖 轉移到另一個的胸膛',
        '指頭還殘留  妳為我  擦的指甲油',
        '我只能永遠讀著對白'
       ],
       ans: 1
    },
    {
       question: '一踏進這地方要幹嘛?',
       choices: [
        '要清楚誰是老大',
        '罩子最好放亮',
        '穿越金星木星水星火星土星追尋',
        '野'
       ],
       ans: 1
    },
    {
       question: '什麼東西遠看像水桶，近看破個洞？',
       choices: [
        '籃筐',
        '水壺',
        '破水桶',
        '你的腦袋'
       ],
       ans: 4
    },
    {
       question: '有人告訴你南大門的英文時，你該如何回答？',
       choices: [
        'South Gate',
        'North Gate',
        'NARUTO!!!',
        'I don\'t know'
       ],
       ans: 3
    },
    {
       question: '甚麼東西讓我走得好緩慢',
       choices: [
        '你的行李',
        '你的背包',
        '你的體重',
        '你媽'
       ],
       ans: 2
    },
    {
       question: '請問這句話總共有幾個字？',
       choices: [
        '0',
        '3',
        '5',
        '11'
       ],
       ans: 2
    },
    {
       question: '請問IKEA的正確發音是什麼?',
       choices: [
        'IKEA',
        'IKEA',
        'IKEA',
        'IKEA'
       ],
       ans: 3
    },
    {
       question: '請問「登登登 登登 登登登登~登登登登~登登」是下面哪首歌的旋律?',
       choices: [
        'loser',
        'teenage riot',
        'flamigo',
        'lemon'
       ],
       ans: 4
    },
    {
       question: '請問胖胖傑今天很餓，想點一份拿坡里母親節活動的媽咪A餐，請問他要付多少錢',
       choices: [
        '1299元',
        '1439元',
        '1479元',
        '1569元'
       ],
       ans: 2
    },
    {
       question: '請問吃菜棒還是吃肉棒？',
       choices: [
        '菜棒',
        '肉棒',
        '營養均衡就好棒',
        '蟹肉棒'
       ],
       ans: 3
    },
    {
       question: '請問直播主－連千毅請網友吃了幾個漢堡',
       choices: [
        '8',
        '9',
        '10',
        '11'
       ],
       ans: 3
    },
    {
       question: '請問資工周活動－麵麵巨道宣傳影片中出現了幾個「然後」',
       choices: [
        '11',
        '13',
        '15',
        '17'
       ],
       ans: 4
    },
    {
       question: '請問海獅會幹嘛？',
       choices: [
        '害怕',
        '跳舞',
        '頂球',
        '游泳'
       ],
       ans: 1
    },
    {
       question: '請問黃政鈺的本名是什麼',
       choices: [
        '瓜呱',
        '呱呱',
        '爪爪',
        '瓜瓜'
       ],
       ans: 4
    },
    ],
    '電玩知識題': [
    {
       question: '赤燭遊戲的作品《還願》相當的夯，請問杜美心的生日是',
       choices: [
        '0716',
        '0616',
        '0516',
        '0416'
       ],
       ans: 1
    },
    {
       question: '華人最大電玩社群網站「巴哈姆特」，至今已邁入第幾年了',
       choices: [
        '8',
        '12',
        '19',
        '22'
       ],
       ans: 4
    },
    {
       question: '請問楓之谷的自由市場每個頻道有幾個洞',
       choices: [
        '21',
        '22',
        '23',
        '24'
       ],
       ans: 2
    },
    {
       question: '請問實況主 - 亞洲統神玩AD的勝率是幾%',
       choices: [
        '50%',
        '69%',
        '75%',
        '87%'
       ],
       ans: 3
    },
    {
       question: '請問實況主國棟「這什麼...到底什麼閃現？喔齁齁齁齁」的那場遊戲玩的是什麼英雄？',
       choices: [
        '燼',
        '寇格魔',
        '汎',
        '希維爾'
       ],
       ans: 2
    },
    {
       question: '請問是哪一隻腳色的手可以穿過統神的巴巴?',
       choices: [
        '菲艾',
        '沃維克',
        '札克',
        '雷克薩'
       ],
       ans: 3
    },
    {
       question: '請問下列在英雄聯盟中哪個英雄「不隸屬」於蒂瑪西亞',
       choices: [
        '汎',
        '杰西',
        '希瓦納',
        '凱爾'
       ],
       ans: 2
    },
    {
       question: '請問英雄聯盟選手FAKER的哪個冠軍造型賣得最好?',
       choices: [
        'SKT T1雷茲 ',
        'SKT T1星朵拉',
        'SKT T1劫',
        'SKT T1加里歐'
       ],
       ans: 2
    },
    {
       question: '請問英雄聯盟中賽恩下巴的皇冠是誰的',
       choices: [
        '嘉文一世',
        '嘉文二世',
        '嘉文三世',
        '嘉文四世'
       ],
       ans: 1
    },
    {
       question: '請問在遊戲英雄聯盟中，下列誰不是初代台服三大劫神',
       choices: [
        '亞洲統神',
        'TOYZ',
        '楓堂歲月',
        '西門夜說'
       ],
       ans: 2
    },
    {
       question: '下列何種線上遊戲沒有出手遊版本',
       choices: [
        '楓之谷',
        'Fortnite',
        '爆爆王',
        'SD鋼彈'
       ],
       ans: 4
    },
    {
       question: '下列哪款遊戲不屬於大逃殺FPS類型？',
       choices: [
        'PUBG',
        'Fortnite',
        'Apex Legend',
        'World War Z'
       ],
       ans: 4
    },
    {
       question: '下列哪位實況主不是台灣人',
       choices: [
        '餐餐自由配',
        'Toyz',
        '企鵝妹',
        '嬌兔'
       ],
       ans: 3
    },
    {
       question: '在電腦發達的現代，人們常用電腦來玩遊戲，請問下列遊戲當中何者銷量最高',
       choices: [
        '當個創世神 Minecraft',
        '超級瑪莉歐兄弟 Super Mario Bros',
        '暗黑破壞神3 Diablo III',
        '俠盜獵車手5 GTA5'
       ],
       ans: 1
    },
    {
       question: '知名電玩大作「隻狼」，其遊戲作者為下列何者',
       choices: [
        '宮崎駿',
        '宮崎英高',
        '宮崎葵',
        '宮崎秋人'
       ],
       ans: 2
    },
    {
       question: '知名實況主「爆哥」以高超的跑跑卡丁車技術聞名，對於車款的收集也在所不惜，下列何種車款花了他約兩萬元？',
       choices: [
        '犽霸X',
        '阿緹密斯9',
        '毛筆X',
        '遊俠9'
       ],
       ans: 2
    },
    {
       question: '知名網頁遊戲Tetris Battle將在今年幾月幾號停止營運？',
       choices: [
        '5/31',
        '6/30',
        '7/31',
        '8/31'
       ],
       ans: 1
    },
    {
       question: '知名線上遊戲「新楓之谷」，其代理商為下列何者',
       choices: [
        '傳奇網路',
        '紅心辣椒',
        '遊戲橘子',
        'Garena'
       ],
       ans: 3
    },
    {
       question: '知名遊戲Minecraft目前最新版本為',
       choices: [
        '1.12',
        '1.13',
        '1.14',
        '1.15'
       ],
       ans: 3
    },
    {
       question: '請問韓國知名英雄聯盟職業選手Faker，使用劫反殺的成名之戰的對手是？',
       choices: [
        'Ambition',
        'Rookie',
        'Scout',
        'Ryu'
       ],
       ans: 4
    },
    {
       question: '請問知名Facebook網頁遊戲「Tetris Battle」在沒有Combo時，完美消除獲得的行數是多少？',
       choices: [
        '10',
        '11',
        '12',
        '13'
       ],
       ans: 1
    },
    {
       question: '請問任天堂Switch是於何時在日本發售？',
       choices: [
        '2017/03/03',
        '2017/04/04',
        '2017/05/05',
        '2017/07/07'
       ],
       ans: 1
    },
    {
       question: '請問急速領域中的暴風勇士是什麼等級的賽車？',
       choices: [
        'S',
        'A',
        'B',
        'C'
       ],
       ans: 3
    },
    {
       question: '請問目前Pokemon Go下列何者沒有神奧進化？',
       choices: [
        '大舌頭',
        '呆呆獸',
        '狃拉',
        '毒薔薇'
       ],
       ans: 2
    },
    {
       question: '請問下列何者不幫國動發大絕',
       choices: [
        '索拉卡',
        '極靈',
        '鏡爪',
        '凱爾'
       ],
       ans: 2
    },
    {
       question: '請問爐石表演賽之王—羅傑，在今年的世界賽中沒帶哪套牌？',
       choices: [
        '炸彈戰',
        '機械聖',
        '節奏賊',
        '巨龍法'
       ],
       ans: 3
    },
    {
       question: '請問魔物獵人裡被稱為公道伯的是哪隻龍？',
       choices: [
        '爆鱗龍',
        '櫻火龍',
        '滅盡龍',
        '飛雷龍'
       ],
       ans: 1
    },
    {
       question: '請問下列哪個遊戲不是Rockstar出的',
       choices: [
        '暴雪英霸',
        '碧血狂殺',
        '黑色洛城',
        '俠盜獵車手'
       ],
       ans: 1
    },
    {
       question: '請問憤怒鳥中共有幾種不同的小鳥？',
       choices: [
        '5',
        '7',
        '9',
        '11'
       ],
       ans: 4
    },
    ],
    '交大校園題': [
    {
       question: '請問2019年Pokemon Go的5月社群日的主角是誰？',
       choices: [
        '穿山鼠',
        '走路草',
        '可達鴨',
        '火雉雞'
       ],
       ans: 4
    },
    {
       question: '從圖書館前往一餐的路上有個涼亭，涼亭前的石碑上印著哪四個字?',
       choices: [
        '堅毅樸實',
        '飲水思源',
        '交通大學',
        '質實剛健'
       ],
       ans: 2
    },
    {
       question: '交大人氣美食「麥當勞」，曾經能用學生證獲取以下哪種優惠？',
       choices: [
        '套餐送蛋捲冰淇淋',
        '套餐免費升級大薯',
        '所有品項八折',
        '所有品項九折'
       ],
       ans: 4
    },
    {
       question: '交大校內一共有幾間全家',
       choices: [
        '1',
        '2',
        '3',
        '4'
       ],
       ans: 3
    },
    {
       question: '姐妹的招牌飯是由什麼組成',
       choices: [
        '鹹豬肉+油雞+蝦捲',
        '鹹豬肉+香腸+油雞',
        '雪花豬+香腸+蝦捲',
        '雪花豬+香腸+油雞'
       ],
       ans: 3
    },
    {
       question: '每年清交大的盛事「梅竹賽」，起源於西元_______年',
       choices: [
        '1988',
        '1975',
        '1969',
        '1953'
       ],
       ans: 3
    },
    {
       question: '請問「活中」與「7舍」中間的建築物名稱為何',
       choices: [
        '管理二館',
        '人社一館',
        '電資大樓',
        '人社三館'
       ],
       ans: 4
    },
    {
       question: '請問工三跟工四哪一層沒有連在一起的',
       choices: [
        '一',
        '二',
        '三',
        '四'
       ],
       ans: 2
    },
    {
       question: '請問交大到台北車站的直線距離大約是多少公里?',
       choices: [
        '60',
        '80',
        '100',
        '150'
       ],
       ans: 1
    },
    {
       question: '請問交大的出納組在什麼地方',
       choices: [
        '中正堂一樓',
        '中正堂二樓',
        '行政大樓一樓',
        '行政大樓二樓'
       ],
       ans: 2
    },
    {
       question: '請問交大怪鳥的名字是甚麼',
       choices: [
        '黃頸黑鷺',
        '黑冠麻鷺',
        '赤腹山雀',
        '笨鳥'
       ],
       ans: 2
    },
    {
       question: '請問交大浩然圖書館的辦公處在幾樓',
       choices: [
        'B1',
        '1樓',
        '2樓',
        '8樓'
       ],
       ans: 2
    },
    {
       question: '請問交大米克Q的炸物哪天沒有供應',
       choices: [
        '星期二',
        '星期三',
        '星期四',
        '星期五'
       ],
       ans: 4
    },
    {
       question: '請問交大資工系辦常駐幾個系辦小姐',
       choices: [
        '9',
        '10',
        '11',
        '12'
       ],
       ans: 3
    },
    {
       question: '請問交通大學的校徽中書上的英文字由左至右為何?',
       choices: [
        'ESA',
        'EAS',
        'SEA',
        'SAE'
       ],
       ans: 1
    },
    {
       question: '請問女二饕爺燒臘的開幕日是哪一天',
       choices: [
        '2018/09/10',
        '2018/09/11',
        '2018/09/17',
        '2018/09/18'
       ],
       ans: 1
    },
    {
       question: '請問下列哪一門通識課上課地點不是綜合一館',
       choices: [
        '馬克思學說之析評',
        '幾何造型',
        '音樂理論導論',
        '心理學概論'
       ],
       ans: 2
    },
    {
       question: '請問小七/全家打幾折',
       choices: [
        '88/85',
        '85/85',
        '88/88',
        '9/85'
       ],
       ans: 1
    },
    {
       question: '下列何者在「2019年交大雲嘉周：古人雲嘉奔皇帝大」中買不到',
       choices: [
        '蛋捲',
        '乳酪條',
        '奶酪',
        '麻糬'
       ],
       ans: 4
    },
    {
       question: '以下社團何者不在交大社團中？',
       choices: [
        '蛋糕社',
        '馬術社',
        '溜溜球社',
        '彩妝保養社'
       ],
       ans: 3
    },
    {
       question: '請問「十三舍」有幾個出入口',
       choices: [
        '2',
        '3',
        '4',
        '5'
       ],
       ans: 3
    },
    {
       question: '請問交大漢堡王是幾月開幕的？',
       choices: [
        '2018/11',
        '2018/12',
        '2019/01',
        '2019/02'
       ],
       ans: 1
    },
    {
       question: '請問交大在2016年底為了培訓什麼階段的資安人才成立「亥客書院」？',
       choices: [
        '高中生',
        '大專生',
        '研究生',
        '在職人員'
       ],
       ans: 4
    },
    {
       question: '請問交大增設什麼學士學位作為多元特殊選才的管道？',
       choices: [
        '繁星',
        '拾穗',
        '成星',
        '百川'
       ],
       ans: 4
    },
    {
       question: '請問下列哪個學餐沒有燒臘店？',
       choices: [
        '一餐',
        '二餐',
        '女二',
        '研三'
       ],
       ans: 2
    },
    {
       question: '請問環校速限是多少',
       choices: [
        '20',
        '30',
        '40',
        '50'
       ],
       ans: 1
    },
    {
       question: '請問吳柏憲有幾個室友？',
       choices: [
        '5',
        '6',
        '7',
        '8'
       ],
       ans: 3
    },
    {
       question: '請問交大校內共有幾個Ubike站？',
       choices: [
        '1',
        '2',
        '3',
        '4'
       ],
       ans: 2
    },
    {
       question: '請問浩然圖書館有幾層',
       choices: [
        '6',
        '7',
        '8',
        '9'
       ],
       ans: 4
    },
    {
       question: '請問交大有幾個學系',
       choices: [
        '20',
        '21',
        '22',
        '23'
       ],
       ans: 1
    },
    {
       question: '請問交大沒有哪個社團',
       choices: [
        '蛋糕社',
        '躲貓貓社',
        '汪汪社',
        '模聯社'
       ],
       ans: 2
    },
    {
       question: '請問交大有幾個排球場',
       choices: [
        '5',
        '6',
        '7',
        '8'
       ],
       ans: 3
    },
    {
       question: '請問今年的梅竹賽沒有什麼項目',
       choices: [
        '排球',
        '籃球',
        '橋牌',
        '撞球'
       ],
       ans: 1
    },
    {
       question: '請問小紅巴沒有停在哪一站',
       choices: [
        '竹湖',
        '綜合一館',
        '計網中心',
        '交大棒球場'
       ],
       ans: 2
    },
    ],
    '社會題': [
    {
       question: '「竹風蘭雨」是形容新竹的冬季多風， 宜蘭的冬季多雨，而形成這種現象的重要 因素為何？ ',
       choices: [
        '緯度',
        '地形',
        '洋流',
        '季風'
       ],
       ans: 4
    },
    {
       question: '1831年12月達爾文搭乘下列哪一艘船，前往南美洲從事自然調查研究工作？',
       choices: [
        '小狼犬號',
        '小獵犬號',
        '波斯貓號',
        '野貓號'
       ],
       ans: 2
    },
    {
       question: '北回歸線通過台灣多少個縣市?',
       choices: [
        '4',
        '5',
        '6',
        '7'
       ],
       ans: 3
    },
    {
       question: '歷史上有名的秦始皇做了許多政績，下列何者不是發生在他任內',
       choices: [
        '焚書坑儒',
        '安史之亂',
        '郡縣制',
        '統一度量衡'
       ],
       ans: 2
    },
    {
       question: '齊睿暑假想坐船回澎湖老家，請問他可以到哪裡搭船到澎湖？',
       choices: [
        '台中港',
        '基隆港',
        '布袋港',
        '台北港'
       ],
       ans: 3
    },
    {
       question: '請問紅綠燈裡的小綠人是哪個國家首先研發的呢',
       choices: [
        '丹麥',
        '德國',
        '台灣',
        '日本'
       ],
       ans: 3
    },
    {
       question: '請問目前台灣政黨輪替了幾次',
       choices: [
        '2',
        '3',
        '4',
        '5'
       ],
       ans: 2
    },
    {
       question: '請問台灣目前有多少邦交國',
       choices: [
        '16',
        '17',
        '19',
        '20'
       ],
       ans: 2
    },
    {
       question: '請問我們現今最常使用的阿拉伯數字是甚麼人發明的呢',
       choices: [
        '阿拉伯人',
        '猶太人',
        '歐洲人',
        '印度人'
       ],
       ans: 4
    },
    {
       question: '請問下列地點何者距離台灣最遠',
       choices: [
        '阿根廷 布林諾斯艾利斯',
        '巴拉圭 雅松森',
        '烏拉圭 蒙德維的雅',
        '玻利維亞 蘇克雷'
       ],
       ans: 2
    },
    {
       question: '請問下列國家哪個國土面積最大',
       choices: [
        '哈薩克',
        '印度',
        '阿根廷',
        '阿爾及利亞'
       ],
       ans: 2
    },
    {
       question: '請問下列何者算是台灣南部',
       choices: [
        '台南',
        '台中',
        '新竹',
        '以上皆是'
       ],
       ans: 1
    },
    {
       question: '俗稱：三月瘋媽祖，四月迎______?',
       choices: [
        '王爺',
        '虎爺',
        '菩薩',
        '文昌'
       ],
       ans: 1
    },
    {
       question: '台灣清治時期三大民變事件不包含下列何者',
       choices: [
        '林爽文事件',
        '戴潮春事件',
        '朱一貴事件',
        '施九緞事件'
       ],
       ans: 4
    },
    {
       question: '下列何者不是開台始祖鄭成功的別稱',
       choices: [
        '延平郡王',
        'Leo王',
        '潮武王',
        '開山王'
       ],
       ans: 2
    },
    {
       question: '許多大學生畢旅會出國，參觀各式各樣有名的景點，請問下列哪個建築物最高',
       choices: [
        '東京晴空塔',
        '上海中心大廈',
        '101大樓',
        '艾菲爾鐵塔'
       ],
       ans: 1
    },
    {
       question: '在母親節，康乃馨是台灣兒女送給母親的代表花，那麼泰國兒女送什麼花給母親？',
       choices: [
        '康乃馨',
        '牡丹花',
        '茉莉花',
        '百合花'
       ],
       ans: 3
    },
    {
       question: '知名景點「民雄鬼屋」以恐怖陰森聞名，請問下列何者是「民雄」的古稱?',
       choices: [
        '打貓',
        '打狗',
        '猴樹港',
        '猿江'
       ],
       ans: 1
    },
    {
       question: '請問新竹從來沒有下列哪個稱呼？',
       choices: [
        '竹塹城',
        '淡水廳城',
        '新竹城',
        '府城'
       ],
       ans: 4
    },
    {
       question: '請問擁有最多妃子的清朝皇帝是?',
       choices: [
        '康熙',
        '雍正',
        '乾隆',
        '嘉慶'
       ],
       ans: 1
    },
    {
       question: '請問下列職務何者是不存在的?',
       choices: [
        '高雄市政府民政局局長',
        '高雄市政府經發局局長',
        '高雄市政府捷運局局長',
        '高雄市政府社福局局長'
       ],
       ans: 4
    },
    {
       question: '請問台灣是亞洲第幾個婚姻平權的國家？',
       choices: [
        '1',
        '2',
        '3',
        '69'
       ],
       ans: 1
    },
    {
       question: '請問下列何者不是台灣的軍艦',
       choices: [
        '海龍號',
        '海虎號',
        '海豹號',
        '海王號'
       ],
       ans: 4
    },
    {
       question: '請問下列哪個不在桃園',
       choices: [
        '石門水庫',
        '拉拉山',
        '武陵農場',
        '統領百貨'
       ],
       ans: 3
    },
    ],
    '時事題': [
    {
       question: '2018年底的縣市長大選，請問台北市候選人丁守中以幾票之差落敗給柯文哲？',
       choices: [
        '6712',
        '3254',
        '10355',
        '36774'
       ],
       ans: 2
    },
    {
       question: '2019年初，Deepmind團隊的AI於哪一款遊戲，以10:1的成績擊敗兩位職業選手',
       choices: [
        '爐石戰記',
        '星海爭霸2',
        '世紀帝國2',
        '英雄聯盟'
       ],
       ans: 2
    },
    {
       question: '2019年舉辦在高雄市的「春吶」吸引了許多攤販、餐車進駐，請問這些攤販總共賣出了多少香腸',
       choices: [
        '6000',
        '2000',
        '48',
        '4'
       ],
       ans: 4
    },
    {
       question: '2019年母親節的正確日期是?',
       choices: [
        '5/5',
        '5/8',
        '5/12',
        '5/15'
       ],
       ans: 3
    },
    {
       question: '國民黨高雄市長候選人韓國瑜最近在網路上被鄉民取了許多綽號，請問下列哪一個不是有關他的綽號？',
       choices: [
        '屁眼俠',
        '國瑜種子',
        '夜襲',
        '韓極混'
       ],
       ans: 3
    },
    {
       question: '歐洲南方天文台最近公布了人類首次拍到的黑洞照片，請問這個黑洞的名字是',
       choices: [
        'Powehi',
        'Marika',
        'Karl',
        'Palakila'
       ],
       ans: 1
    },
    {
       question: '請問谷關長年來以什麼聞名?',
       choices: [
        '空氣',
        '溫泉',
        '咖啡',
        '慶記'
       ],
       ans: 2
    },
    {
       question: '請問在「我們與資夜的距離」影片中，女二與資夜的距離約為多少',
       choices: [
        '320公尺',
        '420公尺',
        '520公尺',
        '620公尺'
       ],
       ans: 3
    },
    {
       question: '熱門訂餐APP「FoodPanda」沒有在哪個縣市服務',
       choices: [
        '台南',
        '高雄',
        '新竹',
        '桃園'
       ],
       ans: 1
    },
    {
       question: '知名美劇「冰與火之歌」目前出到第幾季？',
       choices: [
        '6',
        '7',
        '8',
        '9'
       ],
       ans: 3
    },
    {
       question: '知名影視娛樂公司「漫威」，近期積極尋找合作夥伴，以下哪位英雄不是預計發行的？',
       choices: [
        '驚奇隊長',
        '鋼鐵人',
        '發財俠',
        '蝙蝠俠'
       ],
       ans: 4
    },
    {
       question: '請問知名電視劇「我們與惡的距離」中的角色宋喬平，是下列哪位演員飾演的？',
       choices: [
        '賈靜雯',
        '周采詩',
        '陳妤',
        '林予晞'
       ],
       ans: 4
    },
    {
       question: '請問下列哪個顏色不是IPhone XR有出的顏色？',
       choices: [
        '藍色',
        '珊瑚色',
        '黃色',
        '橘色'
       ],
       ans: 3
    },
    {
       question: '請問目前（2019年）新竹市長為下列何人？',
       choices: [
        '王世堅',
        '林智堅',
        '林智勝',
        '林佳龍'
       ],
       ans: 2
    },
    {
       question: '請問近日美國對中國的懲罰性關稅提高了幾個百分比？',
       choices: [
        '10',
        '15',
        '20',
        '25'
       ],
       ans: 2
    },
    {
       question: '請問即將與交大合併的陽明大學現任校長為下列何者？',
       choices: [
        '管中閔',
        '郭旭崧',
        '賀陳弘',
        '蘇慧貞'
       ],
       ans: 2
    },
    {
       question: '請問2019年端午節是國曆幾月幾日？',
       choices: [
        '5月5日',
        '5月24日',
        '6月7日',
        '6月14日'
       ],
       ans: 3
    },
    {
       question: '請問「司法院釋字第748號解釋施行法」將於何日實施？',
       choices: [
        '2019/5/24',
        '2019/5/27',
        '2019/6/1',
        '2020/1/1'
       ],
       ans: 1
    },
    {
       question: '請問2019年建築大師貝聿銘以幾歲辭世？',
       choices: [
        '88',
        '98',
        '100',
        '102'
       ],
       ans: 4
    },
    {
       question: '2019年資工之夜的名稱是',
       choices: [
        '知識份子',
        '姿勢份子',
        '直尺份子',
        '資事份子'
       ],
       ans: 4
    },
    {
       question: '請問108大學學測的國文作文題目是下列何者?',
       choices: [
        '我們這個世代',
        '溫暖的心',
        '接納',
        '壑'
       ],
       ans: 2
    },
    {
       question: '請問最近日本更換的新年號為何？',
       choices: [
        '令和',
        '万和',
        '久化',
        '万保'
       ],
       ans: 1
    },
    {
       question: '最近日本新上任的天皇是？',
       choices: [
        '明仁',
        '德仁',
        '裕仁',
        '嘉仁'
       ],
       ans: 2
    },
    {
       question: '請問台灣人去下列哪個國家需要簽證？',
       choices: [
        '日本',
        '美國',
        '新加坡',
        '泰國'
       ],
       ans: 4
    },
    {
       question: '請問高雄自經區',
       choices: [
        '就是讓台中發大財啊',
        '就是讓台北發大財啊',
        '就是讓台南發大財啊',
        '就是讓高雄發大財啊'
       ],
       ans: 4
    },
    {
       question: '請問最近波音被停飛的飛機是？',
       choices: [
        '737',
        '747',
        '737 MAX',
        '747 MAX'
       ],
       ans: 3
    },
    ],
    '體育題': [
    {
       question: '2018年美國職棒大聯盟MLB的冠軍為下列哪支球隊?',
       choices: [
        '太空人',
        '釀酒人',
        '紅襪',
        '道奇'
       ],
       ans: 3
    },
    {
       question: '棒球規則中，若安打彈地後彈出全壘打牆，則視為？',
       choices: [
        '全壘打',
        '出局',
        '一壘安打',
        '二壘安打'
       ],
       ans: 4
    },
    {
       question: '高爾夫球中，下列何者「不是」低於標準桿三桿的別稱',
       choices: [
        '雙鷹球（double eagle）',
        '鳳凰（Phoenix）',
        '信天翁（albatross）',
        '金鷹（golden eagle）'
       ],
       ans: 2
    },
    {
       question: '請問棒球術語中的「敬遠球」代表甚麼',
       choices: [
        '故意四壞球保送',
        '內野安打',
        '全壘打',
        '暴投'
       ],
       ans: 1
    },
    {
       question: '請問棒球選手世界的大王，「柏融大王」現在是哪一隊球員',
       choices: [
        'Lamigo',
        '中信兄弟',
        '台灣啤酒',
        '日本火腿'
       ],
       ans: 4
    },
    {
       question: '請問下列哪一個項目在今年北資盃沒有拿冠軍',
       choices: [
        '女排',
        '男籃',
        '女籃',
        '桌球'
       ],
       ans: 2
    },
    {
       question: '請問NBA球星「Lebron James」總共轉隊過幾次',
       choices: [
        '1次',
        '2次',
        '3次',
        '4次'
       ],
       ans: 3
    },
    {
       question: '請問NBA知名球星Kyrie Irving單場最高得分是幾分',
       choices: [
        '55',
        '57',
        '59',
        '61'
       ],
       ans: 2
    },
    {
       question: '請問Stephen Curry在5/1與火箭的系列賽第二戰時脫臼的手指是那一隻？',
       choices: [
        '左手中指',
        '右手食指',
        '左手小指',
        '右手小指'
       ],
       ans: 1
    },
    {
       question: '台灣每年的籃球盛事「威廉瓊斯盃」已舉辦多年，請問2018年該項賽事的第一名隊伍為何?',
       choices: [
        '中華藍隊',
        '中華白隊',
        '菲律賓隊',
        '加拿大隊'
       ],
       ans: 4
    },
    {
       question: '下列何者「不是」豪神林書豪待過的球隊',
       choices: [
        '金州勇士',
        '休士頓火箭',
        '亞特蘭大老鷹',
        '波士頓賽爾提克'
       ],
       ans: 4
    },
    {
       question: '現今台灣職業籃球聯盟SBL規則中，一隊最多能擁有多少洋將',
       choices: [
        '0',
        '1',
        '2',
        '3'
       ],
       ans: 3
    },
    {
       question: '以下哪所高中為2019年HBL冠軍球隊?',
       choices: [
        '能仁',
        '松山',
        '高苑',
        '南山'
       ],
       ans: 1
    },
    {
       question: '以下哪支球隊為2019年SBL聯盟的冠軍球隊?',
       choices: [
        '台銀',
        '富邦',
        '台啤',
        '璞園'
       ],
       ans: 2
    },
    {
       question: '足球運動中，會對攻擊方向前傳接球時接球者允許的位置做出限制的規則，稱為？',
       choices: [
        '越線',
        '走步',
        '越位',
        '手球'
       ],
       ans: 3
    },
    {
       question: 'KJ最喜歡的NBA球星是波士頓賽爾提克隊背號11號的Kyrie Irving，請問下列哪位球星也穿過背號11號',
       choices: [
        'Kobe Bryant',
        'Jeremy Lin',
        'Ming Yao',
        'Stephen Curry'
       ],
       ans: 3
    },
    {
       question: 'MLB美國職棒大聯盟底下又分為哪兩聯盟？',
       choices: [
        '國家聯盟和美國聯盟',
        '中央聯盟和太平洋聯盟',
        '東區聯盟和西區聯盟',
        '夢幻聯盟和魔法聯盟'
       ],
       ans: 1
    },
    {
       question: 'NBA勇士隊近年以Stephen Curry及Klay Thompson為球隊核心，屢屢征服季後賽的賽場，請問這兩個人的組合稱為以下何者',
       choices: [
        '雙槍兄弟',
        '浪花兄弟',
        '放浪兄弟',
        '中信兄弟'
       ],
       ans: 2
    },
    {
       question: '以下有關「慢速壘球」的規則，何者錯誤',
       choices: [
        '二好球後擊出界外球，算三振出局',
        '觸身球不保送，僅以一壞球計',
        '跑者不得盜壘',
        '可以使用短打'
       ],
       ans: 4
    },
    {
       question: '下列何者是台灣第一位登上大聯盟的球員？',
       choices: [
        '陳金鋒',
        '王建民',
        '曹錦輝',
        '郭泓志'
       ],
       ans: 1
    },
    {
       question: '下列哪個城市沒有NBA球隊？',
       choices: [
        '奧克拉荷馬',
        '波士頓',
        '舊金山',
        '沙加緬度'
       ],
       ans: 3
    },
    {
       question: '請問zaza於2017/5/14西區決賽第一場時因為伸出哪隻腳導致kawhi的哪隻腳受傷？',
       choices: [
        '右/右',
        '右/左',
        '左/右',
        '左/左'
       ],
       ans: 4
    },
    {
       question: '請問誰沒拿過NBA總冠軍賽的FMVP',
       choices: [
        '杜蘭特',
        '伊古達拉',
        '柯瑞',
        '喇叭詹'
       ],
       ans: 3
    },
    {
       question: '請問熱火知名球星－韋德的英文名字怎麼拼',
       choices: [
        'Dwayne Wade',
        'Dywane Wade',
        'Dwane Wade',
        'Dwyane Wade'
       ],
       ans: 4
    },
    {
       question: '請問以下哪位NBA球員沒進入今年的常規賽mvp的候選名單內？',
       choices: [
        '勇士死神杜蘭特',
        '公鹿一哥坤波',
        '火箭飯飯哈登',
        '雷霆希望喬治'
       ],
       ans: 1
    },
    {
       question: '請問今年NBA選秀會誰握有榜眼籤？',
       choices: [
        '鵜鶘',
        '尼克',
        '灰熊',
        '湖人'
       ],
       ans: 3
    },
    ],
    '音樂題': [
    {
       question: '請問「我邊寫繁體字，邊反體制」這句歌詞是出自誰的作品',
       choices: [
        '熊仔',
        'KyrieJ',
        '屁孩 Ryan',
        'PG One'
       ],
       ans: 2
    },
    {
       question: '請問歌手Aimer因為聲帶受損而時用何種療法?',
       choices: [
        '冷凍療法',
        '沉默療法',
        '護嗓食療',
        '微創甲狀軟骨聲帶整型術'
       ],
       ans: 2
    },
    {
       question: '請問韓團TWICE中下列哪位不是韓國人?',
       choices: [
        '娜璉',
        '定延',
        'Sana',
        '多賢'
       ],
       ans: 3
    },
    {
       question: '請問樂團ONE OK ROCK的鼓手是誰?',
       choices: [
        'Taka',
        'Toru',
        'Ryota',
        'Tomoya'
       ],
       ans: 4
    },
    {
       question: '請問米津玄師在以個人身分出道之前是用什麼名字在推出歌曲?',
       choices: [
        'hachi',
        'sasuke',
        'hanashi',
        'sina'
       ],
       ans: 1
    },
    {
       question: '請問下列哪位歌手沒得過葛萊美獎',
       choices: [
        'Ed Sheeran',
        'Katy Perry',
        'Bruno Mars',
        'Adele'
       ],
       ans: 2
    },
    {
       question: '請問下列哪一句歌詞沒有出現在交大最知名的饒舌歌 <宰熊貓> 中',
       choices: [
        '講出這種話的智商，要是我早就投胎',
        '清大和頂大的距離是一條交清小徑',
        '不用強調自己有多努力',
        '被竹教併校那我想你們該重考'
       ],
       ans: 4
    },
    {
       question: '請問在2018交大資工相見歡的主題曲「相見歡Intro」，「____，____，____，____都是我homie 」這句歌詞之中，誰的名字沒有出現',
       choices: [
        '竣傑',
        '厚儀',
        '柏盛',
        '雅暄'
       ],
       ans: 1
    },
    {
       question: '請問周杰倫【給我一首歌的時間】有多長？',
       choices: [
        '3分14秒',
        '3分41秒',
        '4分13秒',
        '4分31秒'
       ],
       ans: 3
    },
    {
       question: '請問周杰倫一共出了多少歌曲?',
       choices: [
        '130',
        '107',
        '113',
        '152'
       ],
       ans: 4
    },
    {
       question: '一個曲子的拍號是6 8 一個小節有六拍，以八分音符為一拍，請問一個小節可以塞幾個四分休止符？',
       choices: [
        '6 個',
        '3 個',
        '12 個',
        '2個'
       ],
       ans: 2
    },
    {
       question: '在 玖壹壹-再會中港路 歌詞中「啦_______，我的中港路要再會啦」，空格中應填入？',
       choices: [
        '啦啦',
        '啦啦啦',
        '啦啦啦啦',
        '啦啦啦啦啦'
       ],
       ans: 3
    },
    {
       question: '作品「胡桃鉗」的作曲家為？',
       choices: [
        '舒伯特',
        '巴哈',
        '柴可夫斯基',
        '貝多芬'
       ],
       ans: 3
    },
    {
       question: '請問知名歌曲"千本櫻"，是由哪位虛擬歌手所演唱呢',
       choices: [
        '初音未來',
        '鏡音鈴',
        '鏡音連',
        'GUMI'
       ],
       ans: 1
    },
    {
       question: '鋼琴的黑鍵加白鍵一共有幾個鍵？',
       choices: [
        '87',
        '88',
        '67',
        '68'
       ],
       ans: 2
    },
    {
       question: '吉他的標準定弦中，音高由低到高分別為哪些',
       choices: [
        'DBEFAD',
        'DBEGBE',
        'EADFAD',
        'EADGBE'
       ],
       ans: 4
    },
    {
       question: '請問“鋼琴詩人”是指下列哪位鋼琴家？',
       choices: [
        '蕭邦',
        '李斯特',
        '莫札特',
        '貝多芬'
       ],
       ans: 1
    },
    {
       question: '跟你女朋友分手，因為？',
       choices: [
        '她很醜',
        '我很溫柔',
        '她技巧不好',
        '我很無聊'
       ],
       ans: 4
    },
    {
       question: '以下四首林俊傑的歌曲，何者和其他三首是不同專輯的歌',
       choices: [
        '她說',
        '當你',
        '愛笑的眼睛',
        '學不會'
       ],
       ans: 4
    },
    {
       question: '請問知名歌曲『走到飛』是由幾名歌手一起合唱的？',
       choices: [
        '5',
        '6',
        '7',
        '8'
       ],
       ans: 3
    },
    {
       question: '請問目前youtube上點閱率第二高的音樂影片為何？',
       choices: [
        'See you again',
        'Shape of You',
        'Uptown Funk',
        'Gangnam Style'
       ],
       ans: 2
    },
    {
       question: '請問2018年Spotify全球最高串流量歌手是下列何者？',
       choices: [
        'Ed Sheeran',
        'Ariana Grande',
        ' Drake',
        'Post Malone'
       ],
       ans: 3
    },
    ],
    '影視動漫題': [
    {
       question: '電影「美國隊長3：英雄內戰」中，何者在內戰中從頭到尾皆屬鋼鐵人陣營',
       choices: [
        '蜘蛛人',
        '黑寡婦',
        '獵鷹',
        '緋紅女巫'
       ],
       ans: 1
    },
    {
       question: '電影哈利波特第一集「神秘的魔法石」中提到，漂浮咒的手勢為何',
       choices: [
        '揮和彈',
        '甩和點',
        '戳和拔',
        '揮和轉'
       ],
       ans: 1
    },
    {
       question: '電影哈利波特中，主角哈利的魔杖是由什麼材質做成',
       choices: [
        '冬青木',
        '鳳凰木',
        '接骨木',
        '紫杉木'
       ],
       ans: 1
    },
    {
       question: '多拉A夢最新的電影版為下列何者',
       choices: [
        'Stand by me',
        '大雄的金銀島',
        '大雄的月球探測記',
        '大雄的南極冰天雪地大冒險'
       ],
       ans: 3
    },
    {
       question: '哈利波特電影中，下列何者不曾被佛地魔拿來當成分靈體?',
       choices: [
        '湯姆瑞斗的日記',
        '雷文克勞的王冕',
        '葛來分多的寶劍',
        '娜吉尼'
       ],
       ans: 3
    },
    {
       question: '近年來，陸劇韓劇日劇風靡全台，台灣的偶像劇也曾經火紅過，請問台灣史上第一部偶像劇為何',
       choices: [
        '百分百女孩',
        '紫禁之巔',
        '惡魔在身邊',
        '流星花園'
       ],
       ans: 4
    },
    {
       question: '近年來很多Youtuber都急速竄紅，請問下列台灣Youtuber誰最南部',
       choices: [
        '蔡哥',
        'HowHow',
        '孫生',
        '放火'
       ],
       ans: 1
    },
    {
       question: '美國隊長的盾牌由以下哪種材質製成',
       choices: [
        '亞德曼金屬',
        '汎金屬',
        '鉑',
        '鉛'
       ],
       ans: 2
    },
    {
       question: '請問「棋靈王」中，佐為被誣陷之後是怎樣死去的？',
       choices: [
        '心臟病發',
        '抑鬱而終',
        '飲毒自殺',
        '投河自盡'
       ],
       ans: 4
    },
    {
       question: '請問「棋靈王」中，本因坊 秀策是哪個時代的人',
       choices: [
        '江戶時代',
        '大正時代',
        '戰國時代',
        '鎌倉時代'
       ],
       ans: 1
    },
    {
       question: '請問「棋靈王」中，擔任監修的職業棋士是誰',
       choices: [
        '岡田結美子',
        '水戶夕里香',
        '吉原由香里',
        '黑嘉嘉'
       ],
       ans: 3
    },
    {
       question: '請問海賊王中，下列何者的懸賞金最高',
       choices: [
        '卡塔庫慄',
        '薩波',
        '索隆',
        '艾斯'
       ],
       ans: 1
    },
    {
       question: '請問海賊王中，在蛋糕島篇被魯夫擊敗的克力架（餅乾果實能力者）是Big Mom的第幾個兒子？',
       choices: [
        '10',
        '17',
        '23',
        '25'
       ],
       ans: 1
    },
    {
       question: '請問火影忍者中，鳴人是第幾代火影',
       choices: [
        '5',
        '6',
        '7',
        '8'
       ],
       ans: 3
    },
    {
       question: '請問火影忍者中，誰不曾是斬首大刀的持有者',
       choices: [
        '桃地再不斬',
        '枇杷十藏',
        '鬼燈滿月',
        '鬼燈水月'
       ],
       ans: 3
    },
    {
       question: '請問火影忍者中，體術「八門遁甲」第六門為何',
       choices: [
        '傷門',
        '休門',
        '驚門',
        '景門'
       ],
       ans: 4
    },
    {
       question: '請問火影忍者中，五尾的本名是什麼',
       choices: [
        '又旅',
        '磯撫',
        '穆王',
        '重明'
       ],
       ans: 3
    },
    {
       question: '請問火影忍者中，下列何者「沒有」參與招募地達羅的行動',
       choices: [
        '宇智波鼬',
        '干柿鬼鮫',
        '培因',
        '蠍'
       ],
       ans: 3
    },
    {
       question: '請問日劇UNNATURAL的主題曲是下面哪一首歌?',
       choices: [
        'pretender',
        'wonderland',
        'pray',
        'lemon'
       ],
       ans: 4
    },
    {
       question: '請問視網膜在華視的節目名稱為何？',
       choices: [
        '網膜夜夜秀',
        '視網膜玻璃',
        '今夜造口夜',
        '天天造口夜'
       ],
       ans: 3
    },
    {
       question: '請問下列電影中哪一個沒有用到時空旅行的概念',
       choices: [
        '復仇者聯盟',
        '魔鬼終結者',
        '回到未來',
        '戰爭遊戲'
       ],
       ans: 4
    },
    {
       question: '請問下列何者不是<Fred吃上癮>頻道的三寶之一',
       choices: [
        'Peter',
        '牛排',
        '天分',
        '松露'
       ],
       ans: 2
    },
    {
       question: '請問下列何者不是Disney旗下的公司?',
       choices: [
        '國家地理頻道',
        '二十世紀福斯',
        'ESPN',
        '夢工廠'
       ],
       ans: 4
    },
    {
       question: '請問下列哪個漫威人物最早被創立',
       choices: [
        '鋼鐵人',
        '美國隊長',
        '雷神索爾',
        '綠巨人浩克'
       ],
       ans: 1
    },
    {
       question: '請問在「棋靈王」中，哪個人沒有在網路上跟sai對弈過',
       choices: [
        '和谷義高',
        '塔矢行洋',
        '塔矢亮',
        '緒方精次'
       ],
       ans: 4
    },
    {
       question: '請問在漫畫獵人中，哪一位是三星獵人呢',
       choices: [
        '帕里斯通',
        '金．富力士',
        '奇犽．揍敵客',
        '凱特'
       ],
       ans: 1
    },
    {
       question: '下列何者不是麥卡貝網路電視製作的節目',
       choices: [
        '現在宅知道',
        '木曜4超玩',
        '拜五趴厚系',
        '誰來晚餐'
       ],
       ans: 4
    },
    {
       question: '下列哪位饒舌歌手並無參加過中國有嘻哈節目？',
       choices: [
        'BCW',
        'PG one',
        '熊仔',
        'Jony J'
       ],
       ans: 3
    },
    {
       question: '知名八點檔「風水世家」總共有多少集數',
       choices: [
        '721',
        '162',
        '871',
        '426'
       ],
       ans: 4
    },
    {
       question: '知名電影「哈利波特」，至目前總共出了幾部電影?',
       choices: [
        '7',
        '8',
        '9',
        '10'
       ],
       ans: 2
    },
    {
       question: '知名動漫「神奇寶貝」中，主角皮卡丘的招式「十萬伏特」無法對下列何者造成傷害',
       choices: [
        '三地鼠',
        '鋼鐵鳥',
        '拉達',
        '瑪瑙水母'
       ],
       ans: 1
    },
    {
       question: '知名動漫「一拳超人」中，何者不屬於S級英雄',
       choices: [
        '傑諾斯',
        '殭屍男',
        '甜心假面',
        '龍捲'
       ],
       ans: 3
    },
    {
       question: '知名美劇「冰與火之歌」中飾演龍女的艾蜜莉·克拉克‬還演出過下列哪一部電影？',
       choices: [
        '我就要你好好的',
        '龐貝',
        '黑豹',
        'X戰警'
       ],
       ans: 1
    },
    {
       question: '「 是我，是我先，明明都是我先來的。」 請為這句經典動漫台詞出自下列哪部作品',
       choices: [
        'NO GAME NO LIFE 遊戲人生',
        '白色相簿2',
        '乒乓',
        '五等分的花嫁'
       ],
       ans: 2
    },
    {
       question: '下列漫畫何者連載時間最長？',
       choices: [
        '蠟筆小新',
        '烏龍派出所',
        '櫻桃小丸子',
        '哆啦A夢'
       ],
       ans: 2
    },
    {
       question: '請問唱PPAP的人叫什麼名字？',
       choices: [
        'Piko一郎',
        'Pocky太郎',
        'Piko太郎',
        'Piko蟑螂'
       ],
       ans: 3
    },
    {
       question: '下列動畫獵人當中，請問何者非6大念的系統？',
       choices: [
        '強化系',
        '操作系',
        '放射系',
        '具現化系'
       ],
       ans: 3
    },
    {
       question: '請問何者非知名網紅團體『wackyboy』的口頭禪？',
       choices: [
        '說到做到！',
        '地！',
        '失敗！',
        '應到未到！'
       ],
       ans: 3
    },
    {
       question: '請問何者名偵探柯南劇場版的上映時間是最早的？',
       choices: [
        '往天國的倒數計時',
        '第十四號獵物',
        '引爆摩天樓',
        '世紀末的魔術師'
       ],
       ans: 3
    },
    {
       question: '請問動漫「我的英雄學院」中，主角為能力ONE FOR ALL繼承的第幾代?',
       choices: [
        '6',
        '7',
        '8',
        '9'
       ],
       ans: 4
    },
    {
       question: '請問動漫「獵人」中，哪個人不是特質系?',
       choices: [
        '莫老五',
        '庫洛洛',
        '派克諾坦',
        '梅雷翁'
       ],
       ans: 1
    },
    ],
    '語文題': [
    {
       question: '「夔」字的讀音同',
       choices: [
        '奎',
        '謝',
        '滅',
        '竊'
       ],
       ans: 1
    },
    {
       question: '「他三修微積分才修過」的英文是什麼',
       choices: [
        'Mr. Huang retook Calculus three times before passing it',
        'He retook Calculus three times before passing it',
        'Mr. Chang retook Algorithm three times before passing it',
        'He retook Algorithm three times before passing it'
       ],
       ans: 2
    },
    {
       question: '秉寬今天不小心喝太多Red Bull，以至於一直跑廁所，請問下列選項哪個不是去尿尿的意思',
       choices: [
        'take a dump',
        'take a piss',
        'take a leak',
        'answer the call of nature'
       ],
       ans: 1
    },
    {
       question: '芳瑀嚴格把關系學會費的收支，人稱「資工鐵公雞」，請問鐵公雞一詞除了小氣之外，還有下列哪個意思呢',
       choices: [
        '大打出手',
        '脾氣古怪',
        '虛張聲勢',
        '臭臉待人'
       ],
       ans: 1
    },
    {
       question: '請問經典國中課文《雅量》中，覺得衣料像一塊塊綠豆糕的是外號為何的同學',
       choices: [
        '小老頭',
        '大十克',
        '大食客',
        '小時代'
       ],
       ans: 3
    },
    {
       question: '請問宋詞《蝶戀花》中「庭院深深深幾許」下一句接甚麼',
       choices: [
        '深字不相鄰請問有幾種排法',
        '楊柳堆煙',
        '還欠十九個錢呢',
        '柳重煙深'
       ],
       ans: 2
    },
    {
       question: '請問下列哪個不是十三經中的春秋三傳',
       choices: [
        '左傳',
        '公羊傳',
        '榖梁傳',
        '毓梁傳'
       ],
       ans: 4
    },
    {
       question: '請問徐霞客遊記是由下列何者所撰寫',
       choices: [
        '徐宏祖',
        '徐志摩',
        '陸小曼',
        '徐佳瑩'
       ],
       ans: 1
    },
    {
       question: '請問英語俗諺「He who has health has hope.」是什麼意思',
       choices: [
        '留得青山在，不怕沒柴燒',
        '禍不單行',
        '三思而後行',
        '健康很重要'
       ],
       ans: 1
    },
    {
       question: '日文中，「薬指」是指下列哪一根手指頭？',
       choices: [
        '拇指',
        '食指',
        '中指',
        '無名指'
       ],
       ans: 4
    },
    {
       question: '日文中，「お尻」是下列哪一個意思？',
       choices: [
        '屁股',
        '肛門',
        '尾椎',
        '盲腸'
       ],
       ans: 1
    },
    {
       question: '日文中「怪我」指的是?',
       choices: [
        '自責',
        '責怪',
        '受傷',
        '生病'
       ],
       ans: 3
    },
    {
       question: '日文中的「米国」是指下列哪一個國家？',
       choices: [
        '英國',
        '台灣',
        '美國',
        '加拿大'
       ],
       ans: 3
    },
    {
       question: '下列新出現的英文單字何者翻譯正確',
       choices: [
        'beer o’clock 九點',
        'bromance  男男同性戀',
        'awesomesauce 神奇的調味料',
        'hangry 餓到生氣'
       ],
       ans: 4
    },
    {
       question: '知名啤酒企業「Asahi」的漢字是？',
       choices: [
        '朝月',
        '朝日',
        '朝田',
        '朝火'
       ],
       ans: 2
    },
    {
       question: '資工系上有很多同學酒醉後容易失態，請問英文中會用哪一種動物來形容酒醉呢',
       choices: [
        'as drunk as a horse(馬)',
        'as drunk as a skunk(臭鼬)',
        'as drunk as a bird(鳥)',
        'as drunk as a beaver(河狸)'
       ],
       ans: 2
    },
    {
       question: 'NBA暴龍隊的林書豪常常坐「冷板凳」，沒有上場機會，請問「冷板凳」在古代，是指誰的座位',
       choices: [
        '政府官員',
        '老師',
        '歌女',
        '皇帝的後宮們'
       ],
       ans: 2
    },
    {
       question: '下列戲曲作品與作者配對，何者「錯誤」',
       choices: [
        '《竇娥冤》- 關漢卿',
        '《西廂記》- 王實甫',
        '《琵琶記》- 馬致遠',
        '《牡丹亭》- 湯顯祖'
       ],
       ans: 3
    },
    {
       question: '請問「低頭族」英文怎麼說',
       choices: [
        'Low head family',
        'phubber',
        'selfie',
        'facepalm'
       ],
       ans: 2
    },
    {
       question: '請問「我看歪腰郵筒」是哪一年學測國文長文的題目',
       choices: [
        '104學測',
        '105學測',
        '106學測',
        '107學測'
       ],
       ans: 2
    },
    {
       question: '下列哪一句話意義與其他三句不同?',
       choices: [
        '世界棒球經典賽中華隊大敗於日本隊',
        '世界棒球經典賽中華隊大敗日本隊',
        '世界棒球經典賽中華隊大勝日本隊',
        '世界棒球經典賽中華隊勝日本隊'
       ],
       ans: 1
    },
    {
       question: '請問「停車__ __楓林晚」該填入哪個詞？',
       choices: [
        '做愛',
        '坐愛',
        '座愛',
        '硬啦'
       ],
       ans: 2
    },
    {
       question: '請問下列何者不是唐宋古文八大家的一員',
       choices: [
        '韓愈',
        '王安石',
        '韓冰',
        '歐陽修'
       ],
       ans: 3
    },
    {
       question: '請問畢業門檻國文要修幾學分',
       choices: [
        '2',
        '4',
        '6',
        '0'
       ],
       ans: 4
    },
    {
       question: '請問「楊厚儀」這三個字有幾劃',
       choices: [
        '35',
        '36',
        '37',
        '38'
       ],
       ans: 3
    },
    ],
    '資工知識題': [
    {
       question: '積體電路上可容納的電晶體數目，約每隔兩年便會增加一倍，請問這是什麼定律',
       choices: [
        '摩爾定律',
        '莫非定律',
        '晶體翻倍定律',
        '電晶定律'
       ],
       ans: 1
    },
    {
       question: '請問「MCSL」是下列哪一堂課程名稱的英文縮寫',
       choices: [
        '數位電路實驗',
        '嵌入式系統設計概論與實作',
        '作業系統設計與實作',
        '微處理機系統實驗'
       ],
       ans: 4
    },
    {
       question: '請問交大資工自108學年度入學開始分成幾組',
       choices: [
        '1',
        '2',
        '3',
        '4'
       ],
       ans: 2
    },
    {
       question: '請問下列何者職稱「不是」教授',
       choices: [
        '單智君',
        '陳永昇',
        '張明峰',
        '易志偉'
       ],
       ans: 1
    },
    {
       question: '請問下列哪個名稱不是交大資訊工程學系的前身',
       choices: [
        '自動控制學系',
        '計算機科學系',
        '計算機工程學系',
        '控制工程學系'
       ],
       ans: 1
    },
    {
       question: '請問以下關於「Loop Unrolling」的敘述何者正確',
       choices: [
        '增加程式碼可讀性',
        '可能增益程式執行效能',
        '有效減少程式碼長度',
        '降低程式平行執行的機會'
       ],
       ans: 2
    },
    {
       question: '請問以下哪位不是「所長」',
       choices: [
        '曾文貴',
        '彭文志',
        '曹孝櫟',
        '曾新穆'
       ],
       ans: 1
    },
    {
       question: '請問在python3.7的環境執行下，有一個變數arr = [100, 200, 300]，下列何者會在執行時噴錯',
       choices: [
        'arr[0]',
        'arr[1]',
        'arr[-1]',
        'arr[3]'
       ],
       ans: 4
    },
    {
       question: '請問資工的驕傲羅文笙在梅竹賽的背號是幾號？',
       choices: [
        '17',
        '0',
        '69',
        '22'
       ],
       ans: 4
    },
    {
       question: '請問C語言中的printf的「f」有甚麼意義',
       choices: [
        '無意義',
        '避免函數名稱重複',
        '格式化字串',
        '正規化字串'
       ],
       ans: 3
    },
    {
       question: '請問LINUX的企鵝標誌名字為何',
       choices: [
        'Tux',
        'Max',
        'Cindy',
        'Sandy'
       ],
       ans: 1
    },
    {
       question: '下列哪個程式語言不是直譯式語言',
       choices: [
        'JavaScript',
        'Python',
        'C',
        'Ruby'
       ],
       ans: 3
    },
    {
       question: '小明的電腦跑起來很慢，請問他應該更換下列何者，較有機會改善電腦效能',
       choices: [
        '滑鼠',
        '鍵盤',
        '螢幕',
        '記憶體'
       ],
       ans: 4
    },
    {
       question: '小明上禮拜三去考了CPE，很幸運的壓線通過，請問他考了幾分？',
       choices: [
        '2',
        '2.4',
        '2.8',
        '3'
       ],
       ans: 2
    },
    {
       question: '有兩堆石頭各有7、5顆，兩人輪流每次從一堆石頭中拿取一顆以上，拿到最後一顆者獲勝，請問先手要如何拿取以保證必勝',
       choices: [
        '第一堆拿3顆',
        '第二堆拿1顆',
        '第一堆拿2顆',
        '第二堆拿5顆'
       ],
       ans: 3
    },
    {
       question: '在建立TCP連線時，需進行 N-way handshaking，請問N為何',
       choices: [
        '1',
        '2',
        '3',
        '4'
       ],
       ans: 3
    },
    {
       question: '下列哪一位教授的辦公室樓層最高',
       choices: [
        '謝續平教授',
        '張立平教授',
        '曾煜棋教授',
        '蔡錫鈞教授'
       ],
       ans: 2
    },
    {
       question: '在使用git的時候，如果有commit後悔了想要拆掉，可以使用下列哪個git指令',
       choices: [
        'git return',
        'git rm',
        'git reset',
        'git back'
       ],
       ans: 3
    },
    {
       question: '一般程式在記憶體分為好幾個區段，其中程式指令會放在以下哪個區段？',
       choices: [
        'Text Section',
        'Data Section',
        'Heap Section',
        'Stack Section'
       ],
       ans: 1
    },
    {
       question: '請問Windows API、Web API中的「API」的全名為何',
       choices: [
        'American Petroleum Institute',
        'Apple Pineapple Integration',
        'Amazon Programming Institute',
        'Application Programming Interface'
       ],
       ans: 4
    },
    {
       question: '請問2015交大資訊逐夢營的營名為何',
       choices: [
        '星空資夏',
        '阿資卡班的逃犯',
        '王者之資',
        '明日資星'
       ],
       ans: 4
    },
    {
       question: '請問2014交大資訊逐夢營的營名為何',
       choices: [
        '星空資夏',
        '阿資卡班的逃犯',
        '王者之資',
        '明日資星'
       ],
       ans: 3
    },
    {
       question: '請問2013交大資訊逐夢營的營名為何',
       choices: [
        '星空資夏',
        '阿資卡班的逃犯',
        '王者之資',
        '明日資星'
       ],
       ans: 2
    },
    {
       question: '請問2012交大資訊逐夢營的營名為何',
       choices: [
        '星空資夏',
        '阿資卡班的逃犯',
        '王者之資',
        '明日資星'
       ],
       ans: 1
    },
    {
       question: '請問今年資工周活動－脂嗜型玩家的英雄聯盟賽事之中，梅竹英雄—黃彥凱用單手擊敗誰',
       choices: [
        '許晉瑋',
        '莊凱傑',
        '張軒瑞',
        '吳柏憲'
       ],
       ans: 4
    },
    {
       question: '請問以下誰現在不是泡麵頭',
       choices: [
        '趙廷恩',
        '李宥儒',
        '蘇育劭',
        '黃信耀'
       ],
       ans: 4
    },
    {
       question: '請問工三系窩現在有幾個懶骨頭',
       choices: [
        '1',
        '2',
        '3',
        '4'
       ],
       ans: 3
    },
    {
       question: '請問Ubuntu18.04的Linux版本是？',
       choices: [
        '3',
        '4',
        '5',
        '18'
       ],
       ans: 2
    },
  ]
}

export { QUI, data, section }
